[Killed] BlockStatement
src/sensitivity/analyzer.ts:23:15
   symbolId: string,
   reelIndices: number[],
   multiplier: number,
-): SlotGameIR {
-  const clone = JSON.parse(JSON.stringify(ir)) as SlotGameIR;
-
-  if (clone.reels.mode !== 'weighted') return clone;
-
-  const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
-  const reelSet = new Set(reelIndices);
-
-  for (let i = 0; i < reels.base.length; i++) {
-    if (!reelSet.has(i)) continue;
-    const reelMap = reels.base[i];
-    if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
-    const current = reelMap[symbolId] ?? 1;
-    reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
-  }
-
-  return clone;
-}
+): SlotGameIR {}
 
 // ─── analyzeSensitivity ───────────────────────────────────────────────────
killedBy: SENS-01: analyzeSensitivity returns baseRtp > 0 for weighted IR baseRtp is positive
statusReason: Cannot read properties of undefined (reading 'topology')

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:31:19
   const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
   const reelSet = new Set(reelIndices);
 
-  for (let i = 0; i < reels.base.length; i++) {
+  for (let i = 0; false; i++) {
     if (!reelSet.has(i)) continue;
     const reelMap = reels.base[i];
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-20: multiplier 2.0 exactly doubles weight on targeted reel
statusReason: expected 10 to be 20 // Object.is equality

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:31:19
   const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
   const reelSet = new Set(reelIndices);
 
-  for (let i = 0; i < reels.base.length; i++) {
+  for (let i = 0; i >= reels.base.length; i++) {
     if (!reelSet.has(i)) continue;
     const reelMap = reels.base[i];
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-20: multiplier 2.0 exactly doubles weight on targeted reel
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:32:9
   const reelSet = new Set(reelIndices);
 
   for (let i = 0; i < reels.base.length; i++) {
-    if (!reelSet.has(i)) continue;
+    if (reelSet.has(i)) continue;
     const reelMap = reels.base[i];
     if (!reelMap) continue;
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-20: multiplier 2.0 exactly doubles weight on targeted reel
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:32:9
   const reelSet = new Set(reelIndices);
 
   for (let i = 0; i < reels.base.length; i++) {
-    if (!reelSet.has(i)) continue;
+    if (false) continue;
     const reelMap = reels.base[i];
     if (!reelMap) continue;
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-22: untargeted reel weight unchanged
statusReason: expected 30 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:34:9
   for (let i = 0; i < reels.base.length; i++) {
     if (!reelSet.has(i)) continue;
     const reelMap = reels.base[i];
-    if (!reelMap) continue;
+    if (true) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-20: multiplier 2.0 exactly doubles weight on targeted reel
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:34:9
   for (let i = 0; i < reels.base.length; i++) {
     if (!reelSet.has(i)) continue;
     const reelMap = reels.base[i];
-    if (!reelMap) continue;
+    if (reelMap) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
killedBy: FAZA 10.7 — Mutation-hardened applyWeightMultiplier MUT-20: multiplier 2.0 exactly doubles weight on targeted reel
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:59:7
   opts?: AnalyzeSensitivityOpts,
 ): Promise<SensitivityReport> {
   // Non-weighted: return empty deltas gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (false) {
     return {
       baseRtp: 0,
killedBy: SENS-05: non-weighted IR returns empty deltas gracefully deltas is empty array, baseRtp is 0
statusReason: expected [ { reelIndex: -1, …(5) }, …(3) ] to deeply equal []

[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:60:12
 ): Promise<SensitivityReport> {
   // Non-weighted: return empty deltas gracefully
   if (ir.reels.mode !== 'weighted') {
-    return {
-      baseRtp: 0,
-      baseHitRate: 0,
-      deltas: [],
-      topInfluencers: [],
-    };
+    return {};
   }
 
killedBy: SENS-05: non-weighted IR returns empty deltas gracefully deltas is empty array, baseRtp is 0
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/sensitivity/analyzer.ts:63:15
     return {
       baseRtp: 0,
       baseHitRate: 0,
-      deltas: [],
+      deltas: ["Stryker was here"],
       topInfluencers: [],
     };
killedBy: SENS-05: non-weighted IR returns empty deltas gracefully deltas is empty array, baseRtp is 0
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Survived] ConditionalExpression
src/sensitivity/analyzer.ts:95:25
 
     const rtpDelta = perturbedResult.rtp - baseRtp;
     const hitRateDelta = perturbedResult.hitRate - baseHitRate;
-    const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
+    const sensitivity = false ? rtpDelta / delta : 0;
 
     deltas.push({

[Survived] MethodExpression
src/sensitivity/analyzer.ts:108:26
   }
 
   // Sort by |sensitivity| descending, take top 5
-  const topInfluencers = deltas
-    .slice()
-    .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
+  const topInfluencers = deltas.slice()
     .slice(0, 5);
 

[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:113:10
     .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
     .slice(0, 5);
 
-  return {
-    baseRtp,
-    baseHitRate,
-    deltas,
-    topInfluencers,
-  };
+  return {};
 }
 
killedBy: SENS-01: analyzeSensitivity returns baseRtp > 0 for weighted IR baseRtp is positive
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:137:7
   const varyReels = config.varyReels;
 
   // Non-weighted: return gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (false) {
     return {
       converged: false,
killedBy: SOLVER-13: non-weighted IR returns converged=false gracefully converged is false, iterations is 0
statusReason: expected 5 to be +0 // Object.is equality

[Survived] EqualityOperator
src/sensitivity/analyzer.ts:171:9
     weightChange = mid;
 
     const error = Math.abs(achievedRtp - config.targetRtp);
-    if (error < tolerance) {
+    if (error <= tolerance) {
       converged = true;
       break;

[Survived] ConditionalExpression
src/sensitivity/analyzer.ts:171:9
     weightChange = mid;
 
     const error = Math.abs(achievedRtp - config.targetRtp);
-    if (error < tolerance) {
+    if (false) {
       converged = true;
       break;

[NoCoverage] BooleanLiteral
src/sensitivity/analyzer.ts:172:19
 
     const error = Math.abs(achievedRtp - config.targetRtp);
     if (error < tolerance) {
-      converged = true;
+      converged = false;
       break;
     }

[Survived] ConditionalExpression
src/sensitivity/analyzer.ts:177:9
     }
 
     // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (achievedRtp < config.targetRtp) {
+    if (false) {
       lo = mid;
     } else {

[Survived] EqualityOperator
src/sensitivity/analyzer.ts:177:9
     }
 
     // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (achievedRtp < config.targetRtp) {
+    if (achievedRtp >= config.targetRtp) {
       lo = mid;
     } else {

[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:184:10
     }
   }
 
-  return {
-    converged,
-    iterations,
-    achievedRtp,
-    targetRtp: config.targetRtp,
-    error: Math.abs(achievedRtp - config.targetRtp),
-    solvedIr,
-    weightChange,
-  };
+  return {};
 }
 
killedBy: SOLVER-07: solveTargetRtp returns all required fields has converged, iterations, achievedRtp, targetRtp, error, solvedIr, weightChange
statusReason: expected 'undefined' to be 'boolean' // Object.is equality

[Survived] ArrowFunction
src/sensitivity/analyzer.ts:220:38
   const evalSpins = config.evalSpins ?? 10000;
 
   // Find wild symbol or fall back to first symbol
-  const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
+  const wildSymbol = ir.symbols.find(() => undefined);
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:223:7
   const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
-  if (!varySymbol) {
+  if (true) {
     return {
       converged: false,
killedBy: TUNER-15: autoTune returns achievedHitRate when targetHitRate set achievedHitRate is defined
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:249:22
   return {
     converged: solverResult.converged,
     achievedRtp: solverResult.achievedRtp,
-    achievedHitRate: config.targetHitRate != null ? finalResult.hitRate : undefined,
+    achievedHitRate: config.targetHitRate == null ? finalResult.hitRate : undefined,
     iterations: solverResult.iterations,
     solvedIr: solverResult.solvedIr,
killedBy: TUNER-15: autoTune returns achievedHitRate when targetHitRate set achievedHitRate is defined
statusReason: expected undefined not to be undefined
