[Killed] ConditionalExpression
src/rg/session.ts:68:9
     const now = nowMs ?? Date.now();
 
     // 1. Self-exclusion
-    if (this.limits.selfExcluded) {
+    if (false) {
       return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
     }
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:68:9
     const now = nowMs ?? Date.now();
 
     // 1. Self-exclusion
-    if (this.limits.selfExcluded) {
+    if (true) {
       return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
     }
killedBy: RG-02: not excluded → allow=true allows spin when not self-excluded
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:69:23
 
     // 1. Self-exclusion
     if (this.limits.selfExcluded) {
-      return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
+      return { allow: true, reason: 'self_excluded', message: 'Player is self-excluded.' };
     }
 
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:69:14
 
     // 1. Self-exclusion
     if (this.limits.selfExcluded) {
-      return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
+      return {};
     }
 
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:74:7
 
     // 2. Max wager per spin
     if (
-      this.limits.maxWagerPerSpin !== undefined &&
-      wager > this.limits.maxWagerPerSpin
+      false
     ) {
       return {
killedBy: RG-06: max_wager exceeded → refused refuses spin when wager > maxWagerPerSpin
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:74:7
 
     // 2. Max wager per spin
     if (
-      this.limits.maxWagerPerSpin !== undefined &&
-      wager > this.limits.maxWagerPerSpin
+      true
     ) {
       return {
killedBy: RG-02: not excluded → allow=true allows spin when not self-excluded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:75:7
     // 2. Max wager per spin
     if (
       this.limits.maxWagerPerSpin !== undefined &&
-      wager > this.limits.maxWagerPerSpin
+      wager <= this.limits.maxWagerPerSpin
     ) {
       return {
killedBy: RG-06: max_wager exceeded → refused refuses spin when wager > maxWagerPerSpin
statusReason: expected true to be false // Object.is equality

[Survived] EqualityOperator
src/rg/session.ts:75:7
     // 2. Max wager per spin
     if (
       this.limits.maxWagerPerSpin !== undefined &&
-      wager > this.limits.maxWagerPerSpin
+      wager >= this.limits.maxWagerPerSpin
     ) {
       return {

[Killed] BlockStatement
src/rg/session.ts:76:7
     if (
       this.limits.maxWagerPerSpin !== undefined &&
       wager > this.limits.maxWagerPerSpin
-    ) {
-      return {
-        allow: false,
-        reason: 'max_wager_exceeded',
-        message: `Wager ${wager} exceeds limit ${this.limits.maxWagerPerSpin}.`,
-      };
-    }
+    ) {}
 
     // 3. Min spin time (only after the first spin has been recorded)
killedBy: RG-06: max_wager exceeded → refused refuses spin when wager > maxWagerPerSpin
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:85:9
     }
 
     // 3. Min spin time (only after the first spin has been recorded)
-    if (this.lastSpinCompletedAt > 0) {
+    if (this.lastSpinCompletedAt <= 0) {
       const minMs = MIN_SPIN_MS[this.jurisdiction];
       const elapsed = now - this.lastSpinCompletedAt;
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-14: UKGC minSpinTime refusal — must wait exactly 2500ms
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:85:39
     }
 
     // 3. Min spin time (only after the first spin has been recorded)
-    if (this.lastSpinCompletedAt > 0) {
-      const minMs = MIN_SPIN_MS[this.jurisdiction];
-      const elapsed = now - this.lastSpinCompletedAt;
-      if (minMs > 0 && elapsed < minMs) {
-        return {
-          allow: false,
-          reason: 'min_spin_time_not_elapsed',
-          message: `Must wait ${minMs - elapsed}ms more before spinning.`,
-        };
-      }
-    }
+    if (this.lastSpinCompletedAt > 0) {}
 
     // 4. Session duration
killedBy: RG-03: UKGC min spin time not elapsed refuses spin when elapsed < 2500ms on UKGC
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:88:11
     if (this.lastSpinCompletedAt > 0) {
       const minMs = MIN_SPIN_MS[this.jurisdiction];
       const elapsed = now - this.lastSpinCompletedAt;
-      if (minMs > 0 && elapsed < minMs) {
+      if (minMs <= 0 && elapsed < minMs) {
         return {
           allow: false,
killedBy: RG-03: UKGC min spin time not elapsed refuses spin when elapsed < 2500ms on UKGC
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:88:24
     if (this.lastSpinCompletedAt > 0) {
       const minMs = MIN_SPIN_MS[this.jurisdiction];
       const elapsed = now - this.lastSpinCompletedAt;
-      if (minMs > 0 && elapsed < minMs) {
+      if (minMs > 0 && elapsed <= minMs) {
         return {
           allow: false,
killedBy: RG-04: UKGC, elapsed >= 2500ms → allow=true allows spin after 2500ms elapsed on UKGC
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/rg/session.ts:92:33
         return {
           allow: false,
           reason: 'min_spin_time_not_elapsed',
-          message: `Must wait ${minMs - elapsed}ms more before spinning.`,
+          message: `Must wait ${minMs + elapsed}ms more before spinning.`,
         };
       }

[Survived] StringLiteral
src/rg/session.ts:92:20
         return {
           allow: false,
           reason: 'min_spin_time_not_elapsed',
-          message: `Must wait ${minMs - elapsed}ms more before spinning.`,
+          message: ``,
         };
       }

[Killed] ConditionalExpression
src/rg/session.ts:99:7
 
     // 4. Session duration
     if (
-      this.limits.maxSessionDurationMs !== undefined &&
-      now - this.startTime >= this.limits.maxSessionDurationMs
+      true
     ) {
       return {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-12: spin ALLOWED when accumulated loss < maxLossSession
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:99:7
 
     // 4. Session duration
     if (
-      this.limits.maxSessionDurationMs !== undefined &&
-      now - this.startTime >= this.limits.maxSessionDurationMs
+      this.limits.maxSessionDurationMs !== undefined || now - this.startTime >= this.limits.maxSessionDurationMs
     ) {
       return {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-12: spin ALLOWED when accumulated loss < maxLossSession
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:100:7
     // 4. Session duration
     if (
       this.limits.maxSessionDurationMs !== undefined &&
-      now - this.startTime >= this.limits.maxSessionDurationMs
+      now - this.startTime < this.limits.maxSessionDurationMs
     ) {
       return {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-12: spin ALLOWED when accumulated loss < maxLossSession
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:100:7
     // 4. Session duration
     if (
       this.limits.maxSessionDurationMs !== undefined &&
-      now - this.startTime >= this.limits.maxSessionDurationMs
+      true
     ) {
       return {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-12: spin ALLOWED when accumulated loss < maxLossSession
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:101:7
     if (
       this.limits.maxSessionDurationMs !== undefined &&
       now - this.startTime >= this.limits.maxSessionDurationMs
-    ) {
-      return {
-        allow: false,
-        reason: 'max_session_duration',
-        message: 'Session duration limit reached.',
-      };
-    }
+    ) {}
 
     // 5. Session loss limit
killedBy: RG-09: session duration exceeded → refused refuses spin when session duration exceeded
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/rg/session.ts:105:18
       return {
         allow: false,
         reason: 'max_session_duration',
-        message: 'Session duration limit reached.',
+        message: "",
       };
     }

[Killed] ConditionalExpression
src/rg/session.ts:111:7
 
     // 5. Session loss limit
     if (
-      this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession
+      true
     ) {
       return {
killedBy: RG-02: not excluded → allow=true allows spin when not self-excluded
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:111:7
 
     // 5. Session loss limit
     if (
-      this.limits.maxLossPerSession !== undefined &&
+      this.limits.maxLossPerSession === undefined &&
       this.netLoss >= this.limits.maxLossPerSession
     ) {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-13: spin REFUSED exactly when totalLoss >= maxLossSession
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:112:7
     // 5. Session loss limit
     if (
       this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession
+      this.netLoss > this.limits.maxLossPerSession
     ) {
       return {
killedBy: RG-07: session loss >= limit → refused refuses spin when netLoss >= maxLossPerSession
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:112:7
     // 5. Session loss limit
     if (
       this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession
+      true
     ) {
       return {
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-12: spin ALLOWED when accumulated loss < maxLossSession
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:113:7
     if (
       this.limits.maxLossPerSession !== undefined &&
       this.netLoss >= this.limits.maxLossPerSession
-    ) {
-      return {
-        allow: false,
-        reason: 'max_loss_session',
-        message: 'Session loss limit reached.',
-      };
-    }
+    ) {}
 
     return { allow: true };
killedBy: FAZA 10.7 — Mutation-hardened RGSession MUT-13: spin REFUSED exactly when totalLoss >= maxLossSession
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/rg/session.ts:126:31
 
   recordSpin(wager: number, win: number, nowMs?: number): RGEvent[] {
     const now = nowMs ?? Date.now();
-    const events: RGEvent[] = [];
+    const events: RGEvent[] = ["Stryker was here"];
 
     // Lazy-initialize the reality-check baseline to the first spin's timestamp.
killedBy: RG-12: recordSpin returns empty events when nothing triggered returns empty array when no events triggered
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/rg/session.ts:143:9
     // Update AML state
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
-    if (win > 0) {
+    if (win >= 0) {
       this.amlState.totalWins += 1;
       this.amlState.consecutiveWins += 1;
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:143:9
     // Update AML state
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
-    if (win > 0) {
+    if (true) {
       this.amlState.totalWins += 1;
       this.amlState.consecutiveWins += 1;
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:153:15
     // AML velocity: sliding 60s window
     const windowStart = now - 60_000;
     this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps.filter(
-      (ts) => ts > windowStart,
+      (ts) => false,
     );
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:158:7
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (
-      !this.amlVelocityFired &&
-      maxSpinsPerMinute !== undefined &&
-      spinsInWindow > maxSpinsPerMinute
+      true
     ) {
       this.amlVelocityFired = true;
killedBy: RG-12: recordSpin returns empty events when nothing triggered returns empty array when no events triggered
statusReason: expected [ { kind: 'aml_velocity_flag', …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/rg/session.ts:158:7
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (
-      !this.amlVelocityFired &&
-      maxSpinsPerMinute !== undefined &&
+      true &&
       spinsInWindow > maxSpinsPerMinute
     ) {
killedBy: RG-17: AML velocity de-bounce does not fire aml_velocity_flag more than once
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:159:7
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (
       !this.amlVelocityFired &&
-      maxSpinsPerMinute !== undefined &&
+      maxSpinsPerMinute === undefined &&
       spinsInWindow > maxSpinsPerMinute
     ) {
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/rg/session.ts:159:7
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (
       !this.amlVelocityFired &&
-      maxSpinsPerMinute !== undefined &&
+      true &&
       spinsInWindow > maxSpinsPerMinute
     ) {

[Killed] EqualityOperator
src/rg/session.ts:160:7
     if (
       !this.amlVelocityFired &&
       maxSpinsPerMinute !== undefined &&
-      spinsInWindow > maxSpinsPerMinute
+      spinsInWindow <= maxSpinsPerMinute
     ) {
       this.amlVelocityFired = true;
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:160:7
     if (
       !this.amlVelocityFired &&
       maxSpinsPerMinute !== undefined &&
-      spinsInWindow > maxSpinsPerMinute
+      true
     ) {
       this.amlVelocityFired = true;
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:161:7
       !this.amlVelocityFired &&
       maxSpinsPerMinute !== undefined &&
       spinsInWindow > maxSpinsPerMinute
-    ) {
-      this.amlVelocityFired = true;
-      this.amlState.flagged = true;
-      this.amlState.flagReason = 'velocity';
-      const event: RGEvent = {
-        kind: 'aml_velocity_flag',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: { spinsInWindow, maxSpinsPerMinute },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    ) {}
 
     // AML win-rate sigma: after 30+ spins
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:162:31
       maxSpinsPerMinute !== undefined &&
       spinsInWindow > maxSpinsPerMinute
     ) {
-      this.amlVelocityFired = true;
+      this.amlVelocityFired = false;
       this.amlState.flagged = true;
       this.amlState.flagReason = 'velocity';
killedBy: RG-17: AML velocity de-bounce does not fire aml_velocity_flag more than once
statusReason: expected 3 to be 1 // Object.is equality

[Survived] StringLiteral
src/rg/session.ts:164:34
     ) {
       this.amlVelocityFired = true;
       this.amlState.flagged = true;
-      this.amlState.flagReason = 'velocity';
+      this.amlState.flagReason = "";
       const event: RGEvent = {
         kind: 'aml_velocity_flag',

[Killed] StringLiteral
src/rg/session.ts:166:15
       this.amlState.flagged = true;
       this.amlState.flagReason = 'velocity';
       const event: RGEvent = {
-        kind: 'aml_velocity_flag',
+        kind: "",
         sessionId: this.sessionId,
         timestamp: now,
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:177:7
 
     // AML win-rate sigma: after 30+ spins
     if (
-      !this.amlWinRateFired &&
+      this.amlWinRateFired &&
       this.amlState.totalSpins >= 30 &&
       this.amlConfig.winRateSigmaThreshold !== undefined
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/rg/session.ts:177:7
 
     // AML win-rate sigma: after 30+ spins
     if (
-      !this.amlWinRateFired &&
-      this.amlState.totalSpins >= 30 &&
-      this.amlConfig.winRateSigmaThreshold !== undefined
+      false
     ) {
       const n = this.amlState.totalSpins;
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Survived] EqualityOperator
src/rg/session.ts:178:7
     // AML win-rate sigma: after 30+ spins
     if (
       !this.amlWinRateFired &&
-      this.amlState.totalSpins >= 30 &&
+      this.amlState.totalSpins < 30 &&
       this.amlConfig.winRateSigmaThreshold !== undefined
     ) {

[Survived] ConditionalExpression
src/rg/session.ts:178:7
     // AML win-rate sigma: after 30+ spins
     if (
       !this.amlWinRateFired &&
-      this.amlState.totalSpins >= 30 &&
+      true &&
       this.amlConfig.winRateSigmaThreshold !== undefined
     ) {

[Killed] EqualityOperator
src/rg/session.ts:179:7
     if (
       !this.amlWinRateFired &&
       this.amlState.totalSpins >= 30 &&
-      this.amlConfig.winRateSigmaThreshold !== undefined
+      this.amlConfig.winRateSigmaThreshold === undefined
     ) {
       const n = this.amlState.totalSpins;
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Survived] ConditionalExpression
src/rg/session.ts:179:7
     if (
       !this.amlWinRateFired &&
       this.amlState.totalSpins >= 30 &&
-      this.amlConfig.winRateSigmaThreshold !== undefined
+      true
     ) {
       const n = this.amlState.totalSpins;

[Killed] BlockStatement
src/rg/session.ts:180:7
       !this.amlWinRateFired &&
       this.amlState.totalSpins >= 30 &&
       this.amlConfig.winRateSigmaThreshold !== undefined
-    ) {
-      const n = this.amlState.totalSpins;
-      const p = 0.35; // expected win rate
-      const actualRate = this.amlState.totalWins / n;
-      const stdErr = Math.sqrt((p * (1 - p)) / n);
-      const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > this.amlConfig.winRateSigmaThreshold) {
-        this.amlWinRateFired = true;
-        this.amlState.flagged = true;
-        this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
-        const event: RGEvent = {
-          kind: 'aml_velocity_flag',
-          sessionId: this.sessionId,
-          timestamp: now,
-          detail: { actualRate, expectedRate: p, sigma, threshold: this.amlConfig.winRateSigmaThreshold },
-        };
-        events.push(event);
-        this.eventLog.push(event);
-      }
-    }
+    ) {}
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Killed] ArithmeticOperator
src/rg/session.ts:184:32
       const n = this.amlState.totalSpins;
       const p = 0.35; // expected win rate
       const actualRate = this.amlState.totalWins / n;
-      const stdErr = Math.sqrt((p * (1 - p)) / n);
+      const stdErr = Math.sqrt(p * (1 - p) * n);
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > this.amlConfig.winRateSigmaThreshold) {
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/rg/session.ts:186:11
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > this.amlConfig.winRateSigmaThreshold) {
+      if (false) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/rg/session.ts:186:11
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > this.amlConfig.winRateSigmaThreshold) {
+      if (sigma <= this.amlConfig.winRateSigmaThreshold) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Survived] BooleanLiteral
src/rg/session.ts:187:32
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > this.amlConfig.winRateSigmaThreshold) {
-        this.amlWinRateFired = true;
+        this.amlWinRateFired = false;
         this.amlState.flagged = true;
         this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';

[Survived] StringLiteral
src/rg/session.ts:189:64
       if (sigma > this.amlConfig.winRateSigmaThreshold) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
-        this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
+        this.amlState.flagReason = this.amlState.flagReason ?? "";
         const event: RGEvent = {
           kind: 'aml_velocity_flag',

[Killed] EqualityOperator
src/rg/session.ts:203:7
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
     if (
-      this.limits.realityCheckIntervalMs !== undefined &&
+      this.limits.realityCheckIntervalMs === undefined &&
       now - (this.lastRealityCheckAt as number) >= this.limits.realityCheckIntervalMs
     ) {
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/rg/session.ts:203:7
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
     if (
-      this.limits.realityCheckIntervalMs !== undefined &&
-      now - (this.lastRealityCheckAt as number) >= this.limits.realityCheckIntervalMs
+      false
     ) {
       this.lastRealityCheckAt = now;
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/rg/session.ts:204:7
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
     if (
       this.limits.realityCheckIntervalMs !== undefined &&
-      now - (this.lastRealityCheckAt as number) >= this.limits.realityCheckIntervalMs
+      now - (this.lastRealityCheckAt as number) > this.limits.realityCheckIntervalMs
     ) {
       this.lastRealityCheckAt = now;
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/rg/session.ts:204:7
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
     if (
       this.limits.realityCheckIntervalMs !== undefined &&
-      now - (this.lastRealityCheckAt as number) >= this.limits.realityCheckIntervalMs
+      now - (this.lastRealityCheckAt as number) < this.limits.realityCheckIntervalMs
     ) {
       this.lastRealityCheckAt = now;
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
src/rg/session.ts:205:7
     if (
       this.limits.realityCheckIntervalMs !== undefined &&
       now - (this.lastRealityCheckAt as number) >= this.limits.realityCheckIntervalMs
-    ) {
-      this.lastRealityCheckAt = now;
-      const event: RGEvent = {
-        kind: 'reality_check_due',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: {
-          totalWagered: this.totalWagered,
-          totalWon: this.totalWon,
-          netLoss: this.netLoss,
-          spinCount: this.spinCount,
-        },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    ) {}
 
     // Session limit warning at 80%
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/rg/session.ts:224:7
 
     // Session limit warning at 80%
     if (
-      this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession * 0.8
+      false
     ) {
       const event: RGEvent = {
killedBy: RG-15: session limit warning at 80% emits session_limit_warning when netLoss reaches 80% of limit
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/rg/session.ts:224:7
 
     // Session limit warning at 80%
     if (
-      this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession * 0.8
+      true
     ) {
       const event: RGEvent = {
killedBy: RG-12: recordSpin returns empty events when nothing triggered returns empty array when no events triggered
statusReason: expected [ { …(4) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/rg/session.ts:225:7
     // Session limit warning at 80%
     if (
       this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession * 0.8
+      this.netLoss < this.limits.maxLossPerSession * 0.8
     ) {
       const event: RGEvent = {
killedBy: RG-15: session limit warning at 80% emits session_limit_warning when netLoss reaches 80% of limit
statusReason: expected undefined not to be undefined

[Killed] ArithmeticOperator
src/rg/session.ts:225:23
     // Session limit warning at 80%
     if (
       this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession * 0.8
+      this.netLoss >= this.limits.maxLossPerSession / 0.8
     ) {
       const event: RGEvent = {
killedBy: RG-15: session limit warning at 80% emits session_limit_warning when netLoss reaches 80% of limit
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
src/rg/session.ts:226:7
     if (
       this.limits.maxLossPerSession !== undefined &&
       this.netLoss >= this.limits.maxLossPerSession * 0.8
-    ) {
-      const event: RGEvent = {
-        kind: 'session_limit_warning',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: {
-          netLoss: this.netLoss,
-          limit: this.limits.maxLossPerSession,
-          pct: this.netLoss / this.limits.maxLossPerSession,
-        },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    ) {}
 
     return events;
killedBy: RG-15: session limit warning at 80% emits session_limit_warning when netLoss reaches 80% of limit
statusReason: expected undefined not to be undefined

[Survived] ArithmeticOperator
src/rg/session.ts:234:16
         detail: {
           netLoss: this.netLoss,
           limit: this.limits.maxLossPerSession,
-          pct: this.netLoss / this.limits.maxLossPerSession,
+          pct: this.netLoss * this.limits.maxLossPerSession,
         },
       };
