[Killed] BlockStatement
src/rg/session.ts:258:79
     };
   }
 
-  cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
-    const threshold = this.amlConfig.cashOutHoldThreshold;
-    if (threshold !== undefined && amount >= threshold) {
-      return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
-    }
-    return { required: false };
-  }
+  cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {}
 
   getEventLog(): readonly RGEvent[] {
killedBy: RG-19: cashOutHold required above threshold returns required=true when amount >= cashOutHoldThreshold
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] LogicalOperator
src/rg/session.ts:260:9
 
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
     const threshold = this.amlConfig.cashOutHoldThreshold;
-    if (threshold !== undefined && amount >= threshold) {
+    if (threshold !== undefined || amount >= threshold) {
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
killedBy: RG-20: cashOutHold false below threshold returns required=false when amount < cashOutHoldThreshold
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:260:9
 
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
     const threshold = this.amlConfig.cashOutHoldThreshold;
-    if (threshold !== undefined && amount >= threshold) {
+    if (true) {
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
killedBy: RG-20: cashOutHold false below threshold returns required=false when amount < cashOutHoldThreshold
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:261:26
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
     const threshold = this.amlConfig.cashOutHoldThreshold;
     if (threshold !== undefined && amount >= threshold) {
-      return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
+      return { required: false, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
     return { required: false };
killedBy: RG-19: cashOutHold required above threshold returns required=true when amount >= cashOutHoldThreshold
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:263:12
     if (threshold !== undefined && amount >= threshold) {
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
-    return { required: false };
+    return {};
   }
 
killedBy: RG-20: cashOutHold false below threshold returns required=false when amount < cashOutHoldThreshold
statusReason: expected undefined to be false // Object.is equality
