[Killed] LogicalOperator
src/rg/session.ts:74:7
 
     // 2. Max wager per spin
     if (
-      this.limits.maxWagerPerSpin !== undefined &&
-      wager > this.limits.maxWagerPerSpin
+      this.limits.maxWagerPerSpin !== undefined || wager > this.limits.maxWagerPerSpin
     ) {
       return {
killedBy: rg-strength: maxWagerPerSpin boundary wager === limit → ALLOWED (strict >, not >=)
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:100:7
     // 4. Session duration
     if (
       this.limits.maxSessionDurationMs !== undefined &&
-      now - this.startTime >= this.limits.maxSessionDurationMs
+      now + this.startTime >= this.limits.maxSessionDurationMs
     ) {
       return {
killedBy: rg-strength: maxSessionDurationMs boundary duration === limit-1 → ALLOWED
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:143:9
     // Update AML state
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
-    if (win > 0) {
+    if (win <= 0) {
       this.amlState.totalWins += 1;
       this.amlState.consecutiveWins += 1;
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected 0 to be greater than 0.9

[Killed] EqualityOperator
src/rg/session.ts:160:7
     if (
       !this.amlVelocityFired &&
       maxSpinsPerMinute !== undefined &&
-      spinsInWindow > maxSpinsPerMinute
+      spinsInWindow >= maxSpinsPerMinute
     ) {
       this.amlVelocityFired = true;
killedBy: rg-strength: AML velocity flag exactly maxSpinsPerMinute spins in window → NO flag
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:177:7
 
     // AML win-rate sigma: after 30+ spins
     if (
-      !this.amlWinRateFired &&
-      this.amlState.totalSpins >= 30 &&
-      this.amlConfig.winRateSigmaThreshold !== undefined
+      true
     ) {
       const n = this.amlState.totalSpins;
killedBy: rg-strength: AML win-rate sigma totalSpins === 29 (< 30) → no sigma check fires
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:177:7
 
     // AML win-rate sigma: after 30+ spins
     if (
-      !this.amlWinRateFired &&
-      this.amlState.totalSpins >= 30 &&
+      true &&
       this.amlConfig.winRateSigmaThreshold !== undefined
     ) {
killedBy: rg-strength: AML win-rate sigma totalSpins === 29 (< 30) → no sigma check fires
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:186:11
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > this.amlConfig.winRateSigmaThreshold) {
+      if (true) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
killedBy: rg-strength: AML win-rate sigma moderate win rate within sigma threshold → no flag
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:224:7
 
     // Session limit warning at 80%
     if (
-      this.limits.maxLossPerSession !== undefined &&
-      this.netLoss >= this.limits.maxLossPerSession * 0.8
+      this.limits.maxLossPerSession !== undefined || this.netLoss >= this.limits.maxLossPerSession * 0.8
     ) {
       const event: RGEvent = {
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.79 → no warning
statusReason: expected { kind: 'session_limit_warning', …(3) } to be undefined
