[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:35:9
     if (!reelSet.has(i)) continue;
     const reelMap = reels.base[i];
     if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
+    if (false) continue;
     const current = reelMap[symbolId] ?? 1;
     reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
killedBy: analyzer-strength: applyWeightMultiplier unknown symbolId → no-op (in operator catches typo)
statusReason: expected '{"mode":"weighted","base":[{"WILD":1,…' to be '{"mode":"weighted","base":[{"WILD":1,…' // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:161:43
   let weightChange = 1;
   let converged = false;
 
-  for (let i = 0; i < maxIterations; i++) {
-    iterations++;
-    const mid = (lo + hi) / 2;
-    const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
-    const result = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
-    achievedRtp = result.rtp;
-    solvedIr = perturbedIr;
-    weightChange = mid;
-
-    const error = Math.abs(achievedRtp - config.targetRtp);
-    if (error < tolerance) {
-      converged = true;
-      break;
-    }
-
-    // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (achievedRtp < config.targetRtp) {
-      lo = mid;
-    } else {
-      hi = mid;
-    }
-  }
+  for (let i = 0; i < maxIterations; i++) {}
 
   return {
killedBy: analyzer-strength: solveTargetRtp bisection default tolerance=0.001 + maxIterations=50 + evalSpins=10000
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:171:9
     weightChange = mid;
 
     const error = Math.abs(achievedRtp - config.targetRtp);
-    if (error < tolerance) {
+    if (error >= tolerance) {
       converged = true;
       break;
killedBy: analyzer-strength: solveTargetRtp bisection converged when |achievedRtp − target| < tolerance
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:220:45
   const evalSpins = config.evalSpins ?? 10000;
 
   // Find wild symbol or fall back to first symbol
-  const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
+  const wildSymbol = ir.symbols.find((s) => s.kind !== 'wild');
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
killedBy: analyzer-strength: autoTune wild-symbol detection finds wild symbol by kind === "wild" (catches `!==` flip)
statusReason: expected 1 not to be 1 // Object.is equality
