[Killed] BlockStatement
src/rg/session.ts:12:25
   MIN_SPIN_MS,
 } from './types.js';
 
-function uuid(): string {
-  return Math.random().toString(36).slice(2) + Date.now().toString(36);
-}
+function uuid(): string {}
 
 interface RGSessionOptions {
killedBy: rg-strength: session id default uuid is non-empty and distinct between instances
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
src/rg/session.ts:13:10
 } from './types.js';
 
 function uuid(): string {
-  return Math.random().toString(36).slice(2) + Date.now().toString(36);
+  return Math.random().toString(36).slice(2) - Date.now().toString(36);
 }
 
killedBy: rg-strength: session id default uuid is non-empty and distinct between instances
statusReason: actual value must be number or bigint, received "undefined"

[Killed] MethodExpression
src/rg/session.ts:13:10
 } from './types.js';
 
 function uuid(): string {
-  return Math.random().toString(36).slice(2) + Date.now().toString(36);
+  return Math.random().toString(36) + Date.now().toString(36);
 }
 
killedBy: W239-FINAL — uuid format invariants (line 13) uuid never contains a dot (kills `Math.random().toString(36)` mutant)
statusReason: expected '0.3c4jw4if42wmprt5sco' not to contain '.'

[Killed] ArrayDeclaration
src/rg/session.ts:43:27
 
   // AML state
   private amlState: AMLState = {
-    recentSpinTimestamps: [],
+    recentSpinTimestamps: ["Stryker was here"],
     consecutiveWins: 0,
     totalWins: 0,
killedBy: W239 — recentSpinTimestamps starts empty (line 43) AML state recentSpinTimestamps is [] before any spin
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BooleanLiteral
src/rg/session.ts:47:14
     consecutiveWins: 0,
     totalWins: 0,
     totalSpins: 0,
-    flagged: false,
+    flagged: true,
   };
   private amlVelocityFired = false;
killedBy: rg-strength: AML velocity flag exactly maxSpinsPerMinute spins in window → NO flag
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:49:30
     totalSpins: 0,
     flagged: false,
   };
-  private amlVelocityFired = false;
+  private amlVelocityFired = true;
   private amlWinRateFired = false;
 
killedBy: W239-FINAL — velocityFired idempotency (line 159) velocity flag fires exactly once across 100 rapid spins
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:50:29
     flagged: false,
   };
   private amlVelocityFired = false;
-  private amlWinRateFired = false;
+  private amlWinRateFired = true;
 
   constructor(opts: RGSessionOptions = {}) {
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
src/rg/session.ts:52:44
   private amlVelocityFired = false;
   private amlWinRateFired = false;
 
-  constructor(opts: RGSessionOptions = {}) {
-    const now = opts.startTime ?? Date.now();
-    this.sessionId = opts.sessionId ?? uuid();
-    this.jurisdiction = opts.jurisdiction ?? 'default';
-    this.limits = opts.limits ?? {};
-    this.amlConfig = opts.aml ?? {};
-    this.startTime = now;
-    // lastRealityCheckAt is initialized lazily on the first recordSpin call
-    // to ensure deterministic behaviour when tests pass explicit nowMs.
-    this.lastRealityCheckAt = null;
-  }
+  constructor(opts: RGSessionOptions = {}) {}
 
   // ── W244 wave 5 — guard methods (Stryker compound-conditional bug workaround)
killedBy: W239-FINAL — uuid format invariants (line 13) uuid never contains a dot (kills `Math.random().toString(36)` mutant)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] LogicalOperator
src/rg/session.ts:53:17
   private amlWinRateFired = false;
 
   constructor(opts: RGSessionOptions = {}) {
-    const now = opts.startTime ?? Date.now();
+    const now = opts.startTime && Date.now();
     this.sessionId = opts.sessionId ?? uuid();
     this.jurisdiction = opts.jurisdiction ?? 'default';
killedBy: rg-strength: maxSessionDurationMs boundary duration === limit → REFUSED (>= predicate)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:54:22
 
   constructor(opts: RGSessionOptions = {}) {
     const now = opts.startTime ?? Date.now();
-    this.sessionId = opts.sessionId ?? uuid();
+    this.sessionId = opts.sessionId && uuid();
     this.jurisdiction = opts.jurisdiction ?? 'default';
     this.limits = opts.limits ?? {};
killedBy: W239-FINAL — uuid format invariants (line 13) uuid never contains a dot (kills `Math.random().toString(36)` mutant)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] LogicalOperator
src/rg/session.ts:55:25
   constructor(opts: RGSessionOptions = {}) {
     const now = opts.startTime ?? Date.now();
     this.sessionId = opts.sessionId ?? uuid();
-    this.jurisdiction = opts.jurisdiction ?? 'default';
+    this.jurisdiction = opts.jurisdiction && 'default';
     this.limits = opts.limits ?? {};
     this.amlConfig = opts.aml ?? {};
killedBy: W239-FINAL — minSpin guard reason wording (lines 85, 88) min-spin refusal carries `min_spin_time_not_elapsed` reason
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/rg/session.ts:55:46
   constructor(opts: RGSessionOptions = {}) {
     const now = opts.startTime ?? Date.now();
     this.sessionId = opts.sessionId ?? uuid();
-    this.jurisdiction = opts.jurisdiction ?? 'default';
+    this.jurisdiction = opts.jurisdiction ?? "";
     this.limits = opts.limits ?? {};
     this.amlConfig = opts.aml ?? {};
killedBy: rg-strength: getState invariants default jurisdiction echoed back
statusReason: expected '' to be 'default' // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:56:19
     const now = opts.startTime ?? Date.now();
     this.sessionId = opts.sessionId ?? uuid();
     this.jurisdiction = opts.jurisdiction ?? 'default';
-    this.limits = opts.limits ?? {};
+    this.limits = opts.limits && {};
     this.amlConfig = opts.aml ?? {};
     this.startTime = now;
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max wager exceeded carries a numeric-containing message
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:57:22
     this.sessionId = opts.sessionId ?? uuid();
     this.jurisdiction = opts.jurisdiction ?? 'default';
     this.limits = opts.limits ?? {};
-    this.amlConfig = opts.aml ?? {};
+    this.amlConfig = opts.aml && {};
     this.startTime = now;
     // lastRealityCheckAt is initialized lazily on the first recordSpin call
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max loss per session reason is exact
statusReason: Cannot read properties of undefined (reading 'maxSpinsPerMinute')

[Killed] BlockStatement
src/rg/session.ts:76:38
   // (faza118, faza1310, w239, w244) all pass unchanged.
 
   /** Player has self-excluded — gate refuses every spin. */
-  private _isSelfExcluded(): boolean {
-    return this.limits.selfExcluded === true;
-  }
+  private _isSelfExcluded(): boolean {}
 
   // Helper: numeric ceiling fallback for undefined optional caps.  Using
killedBy: rg-strength: self-exclusion branch self_excluded=true → refuses with exact reason+message
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:77:12
 
   /** Player has self-excluded — gate refuses every spin. */
   private _isSelfExcluded(): boolean {
-    return this.limits.selfExcluded === true;
+    return this.limits.selfExcluded !== true;
   }
 
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max wager exceeded carries a numeric-containing message
statusReason: expected 'self_excluded' to be 'max_wager_exceeded' // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:77:12
 
   /** Player has self-excluded — gate refuses every spin. */
   private _isSelfExcluded(): boolean {
-    return this.limits.selfExcluded === true;
+    return false;
   }
 
killedBy: rg-strength: self-exclusion branch self_excluded=true → refuses with exact reason+message
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:86:55
   // remains a single non-compound expression that mutates cleanly.
 
   /** Wager exceeds the per-spin cap (or no cap configured → false). */
-  private _isMaxWagerExceeded(wager: number): boolean {
-    return wager > (this.limits.maxWagerPerSpin ?? Infinity);
-  }
+  private _isMaxWagerExceeded(wager: number): boolean {}
 
   /** Less time than jurisdiction-min has passed since the prior spin. */
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max wager exceeded carries a numeric-containing message
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:87:12
 
   /** Wager exceeds the per-spin cap (or no cap configured → false). */
   private _isMaxWagerExceeded(wager: number): boolean {
-    return wager > (this.limits.maxWagerPerSpin ?? Infinity);
+    return wager <= (this.limits.maxWagerPerSpin ?? Infinity);
   }
 
killedBy: rg-strength: self-exclusion branch self_excluded=false → allows
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:87:12
 
   /** Wager exceeds the per-spin cap (or no cap configured → false). */
   private _isMaxWagerExceeded(wager: number): boolean {
-    return wager > (this.limits.maxWagerPerSpin ?? Infinity);
+    return true;
   }
 
killedBy: rg-strength: self-exclusion branch self_excluded=false → allows
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:91:103
   }
 
   /** Less time than jurisdiction-min has passed since the prior spin. */
-  private _isMinSpinTimeViolation(now: number): { violated: boolean; minMs: number; elapsed: number } {
-    const minMs = MIN_SPIN_MS[this.jurisdiction];
-    const elapsed = now - this.lastSpinCompletedAt;
-    // Single boolean: pre-first-spin (lastSpinCompletedAt === 0) OR
-    // jurisdiction-min is zero OR elapsed is already past min → no violation.
-    const violated = this.lastSpinCompletedAt > 0 && minMs > 0 && elapsed < minMs;
-    return { violated, minMs, elapsed };
-  }
+  private _isMinSpinTimeViolation(now: number): { violated: boolean; minMs: number; elapsed: number } {}
 
   /** Elapsed session-wall-clock has reached the configured cap. */
killedBy: rg-strength: self-exclusion branch self_excluded=false → allows
statusReason: Cannot read properties of undefined (reading 'violated')

[Killed] ArithmeticOperator
src/rg/session.ts:93:21
   /** Less time than jurisdiction-min has passed since the prior spin. */
   private _isMinSpinTimeViolation(now: number): { violated: boolean; minMs: number; elapsed: number } {
     const minMs = MIN_SPIN_MS[this.jurisdiction];
-    const elapsed = now - this.lastSpinCompletedAt;
+    const elapsed = now + this.lastSpinCompletedAt;
     // Single boolean: pre-first-spin (lastSpinCompletedAt === 0) OR
     // jurisdiction-min is zero OR elapsed is already past min → no violation.
killedBy: rg-strength: min spin time boundary UKGC: elapsed === minMs - 1 → REFUSED
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:96:67
     const elapsed = now - this.lastSpinCompletedAt;
     // Single boolean: pre-first-spin (lastSpinCompletedAt === 0) OR
     // jurisdiction-min is zero OR elapsed is already past min → no violation.
-    const violated = this.lastSpinCompletedAt > 0 && minMs > 0 && elapsed < minMs;
+    const violated = this.lastSpinCompletedAt > 0 && minMs > 0 && elapsed >= minMs;
     return { violated, minMs, elapsed };
   }
killedBy: W244 RG-02: pre-first-spin lastSpinCompletedAt branch (UKGC minSpin) after first recordSpin, UKGC minSpin guard does refuse a too-fast follow-up
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:96:22
     const elapsed = now - this.lastSpinCompletedAt;
     // Single boolean: pre-first-spin (lastSpinCompletedAt === 0) OR
     // jurisdiction-min is zero OR elapsed is already past min → no violation.
-    const violated = this.lastSpinCompletedAt > 0 && minMs > 0 && elapsed < minMs;
+    const violated = true;
     return { violated, minMs, elapsed };
   }
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max session duration reason is exact
statusReason: expected 'min_spin_time_not_elapsed' to be 'max_session_duration' // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:97:12
     // Single boolean: pre-first-spin (lastSpinCompletedAt === 0) OR
     // jurisdiction-min is zero OR elapsed is already past min → no violation.
     const violated = this.lastSpinCompletedAt > 0 && minMs > 0 && elapsed < minMs;
-    return { violated, minMs, elapsed };
+    return {};
   }
 
killedBy: W244 RG-02: pre-first-spin lastSpinCompletedAt branch (UKGC minSpin) after first recordSpin, UKGC minSpin guard does refuse a too-fast follow-up
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:101:62
   }
 
   /** Elapsed session-wall-clock has reached the configured cap. */
-  private _isMaxSessionDurationReached(now: number): boolean {
-    return now - this.startTime >= (this.limits.maxSessionDurationMs ?? Infinity);
-  }
+  private _isMaxSessionDurationReached(now: number): boolean {}
 
   /** Cumulative net loss has reached the session-loss cap. */
killedBy: W239 — maxSessionDurationMs branches (line 99-100) exactly at limit → refused (boundary, kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:102:37
 
   /** Elapsed session-wall-clock has reached the configured cap. */
   private _isMaxSessionDurationReached(now: number): boolean {
-    return now - this.startTime >= (this.limits.maxSessionDurationMs ?? Infinity);
+    return now - this.startTime >= (this.limits.maxSessionDurationMs && Infinity);
   }
 
killedBy: W239 — maxSessionDurationMs branches (line 99-100) exactly at limit → refused (boundary, kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:102:12
 
   /** Elapsed session-wall-clock has reached the configured cap. */
   private _isMaxSessionDurationReached(now: number): boolean {
-    return now - this.startTime >= (this.limits.maxSessionDurationMs ?? Infinity);
+    return true;
   }
 
killedBy: W244 RG-01: maxWagerPerSpin undefined ⇒ no max_wager_exceeded refusal omitting maxWagerPerSpin allows arbitrarily large wagers
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:106:47
   }
 
   /** Cumulative net loss has reached the session-loss cap. */
-  private _isMaxLossSessionReached(): boolean {
-    return this.netLoss >= (this.limits.maxLossPerSession ?? Infinity);
-  }
+  private _isMaxLossSessionReached(): boolean {}
 
   checkSpinAllowed(wager: number, nowMs?: number): RGDecision {
killedBy: W239 — maxLossPerSession branches (line 111-112) exact net loss == limit → refused (boundary kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:107:29
 
   /** Cumulative net loss has reached the session-loss cap. */
   private _isMaxLossSessionReached(): boolean {
-    return this.netLoss >= (this.limits.maxLossPerSession ?? Infinity);
+    return this.netLoss >= (this.limits.maxLossPerSession && Infinity);
   }
 
killedBy: W239 — maxLossPerSession branches (line 111-112) exact net loss == limit → refused (boundary kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:107:12
 
   /** Cumulative net loss has reached the session-loss cap. */
   private _isMaxLossSessionReached(): boolean {
-    return this.netLoss >= (this.limits.maxLossPerSession ?? Infinity);
+    return this.netLoss > (this.limits.maxLossPerSession ?? Infinity);
   }
 
killedBy: W239 — maxLossPerSession branches (line 111-112) exact net loss == limit → refused (boundary kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:111:17
   }
 
   checkSpinAllowed(wager: number, nowMs?: number): RGDecision {
-    const now = nowMs ?? Date.now();
+    const now = nowMs && Date.now();
 
     // 1. Self-exclusion
killedBy: W239 — maxSessionDurationMs branches (line 99-100) one ms below limit → allowed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:114:33
     const now = nowMs ?? Date.now();
 
     // 1. Self-exclusion
-    if (this._isSelfExcluded()) {
-      return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
-    }
+    if (this._isSelfExcluded()) {}
 
     // 2. Max wager per spin
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:114:9
     const now = nowMs ?? Date.now();
 
     // 1. Self-exclusion
-    if (this._isSelfExcluded()) {
+    if (false) {
       return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
     }
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:115:23
 
     // 1. Self-exclusion
     if (this._isSelfExcluded()) {
-      return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
+      return { allow: true, reason: 'self_excluded', message: 'Player is self-excluded.' };
     }
 
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:115:14
 
     // 1. Self-exclusion
     if (this._isSelfExcluded()) {
-      return { allow: false, reason: 'self_excluded', message: 'Player is self-excluded.' };
+      return {};
     }
 
killedBy: RG-01: self_excluded → allow=false refuses spin when selfExcluded=true
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:119:9
     }
 
     // 2. Max wager per spin
-    if (this._isMaxWagerExceeded(wager)) {
+    if (true) {
       return {
         allow: false,
killedBy: W239 — maxWagerPerSpin true/false branches (line 74) limit undefined → unlimited wager allowed (false branch)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:119:9
     }
 
     // 2. Max wager per spin
-    if (this._isMaxWagerExceeded(wager)) {
+    if (false) {
       return {
         allow: false,
killedBy: RG-06: max_wager exceeded → refused refuses spin when wager > maxWagerPerSpin
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:120:14
 
     // 2. Max wager per spin
     if (this._isMaxWagerExceeded(wager)) {
-      return {
-        allow: false,
-        reason: 'max_wager_exceeded',
-        message: `Wager ${wager} exceeds limit ${this.limits.maxWagerPerSpin}.`,
-      };
+      return {};
     }
 
killedBy: RG-06: max_wager exceeded → refused refuses spin when wager > maxWagerPerSpin
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:121:16
     // 2. Max wager per spin
     if (this._isMaxWagerExceeded(wager)) {
       return {
-        allow: false,
+        allow: true,
         reason: 'max_wager_exceeded',
         message: `Wager ${wager} exceeds limit ${this.limits.maxWagerPerSpin}.`,
killedBy: W239 — maxWagerPerSpin true/false branches (line 74) limit set, wager exceeds → refused (true branch)
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/rg/session.ts:122:17
     if (this._isMaxWagerExceeded(wager)) {
       return {
         allow: false,
-        reason: 'max_wager_exceeded',
+        reason: "",
         message: `Wager ${wager} exceeds limit ${this.limits.maxWagerPerSpin}.`,
       };
killedBy: W239 — maxWagerPerSpin true/false branches (line 74) limit set, wager exceeds → refused (true branch)
statusReason: expected '' to be 'max_wager_exceeded' // Object.is equality

[Killed] StringLiteral
src/rg/session.ts:123:18
       return {
         allow: false,
         reason: 'max_wager_exceeded',
-        message: `Wager ${wager} exceeds limit ${this.limits.maxWagerPerSpin}.`,
+        message: ``,
       };
     }
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max wager exceeded carries a numeric-containing message
statusReason: expected '' to contain '123'

[Killed] ConditionalExpression
src/rg/session.ts:129:9
 
     // 3. Min spin time (only after the first spin has been recorded)
     const minSpin = this._isMinSpinTimeViolation(now);
-    if (minSpin.violated) {
+    if (false) {
       return {
         allow: false,
killedBy: W244 RG-02: pre-first-spin lastSpinCompletedAt branch (UKGC minSpin) after first recordSpin, UKGC minSpin guard does refuse a too-fast follow-up
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:129:9
 
     // 3. Min spin time (only after the first spin has been recorded)
     const minSpin = this._isMinSpinTimeViolation(now);
-    if (minSpin.violated) {
+    if (true) {
       return {
         allow: false,
killedBy: W239 — maxWagerPerSpin true/false branches (line 74) limit undefined → unlimited wager allowed (false branch)
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/rg/session.ts:132:17
     if (minSpin.violated) {
       return {
         allow: false,
-        reason: 'min_spin_time_not_elapsed',
+        reason: "",
         message: `Must wait ${minSpin.minMs - minSpin.elapsed}ms more before spinning.`,
       };
killedBy: W244 RG-02: pre-first-spin lastSpinCompletedAt branch (UKGC minSpin) after first recordSpin, UKGC minSpin guard does refuse a too-fast follow-up
statusReason: expected '' to be 'min_spin_time_not_elapsed' // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:133:31
       return {
         allow: false,
         reason: 'min_spin_time_not_elapsed',
-        message: `Must wait ${minSpin.minMs - minSpin.elapsed}ms more before spinning.`,
+        message: `Must wait ${minSpin.minMs + minSpin.elapsed}ms more before spinning.`,
       };
     }
killedBy: W239-FINAL — minSpin elapsed value in message (line 92) message includes the wait-time delta
statusReason: expected 'Must wait 3500ms more before spinning.' to contain '1500'

[Killed] StringLiteral
src/rg/session.ts:133:18
       return {
         allow: false,
         reason: 'min_spin_time_not_elapsed',
-        message: `Must wait ${minSpin.minMs - minSpin.elapsed}ms more before spinning.`,
+        message: ``,
       };
     }
killedBy: W239-FINAL — minSpin guard reason wording (lines 85, 88) min-spin refusal carries `min_spin_time_not_elapsed` reason
statusReason: expected '' to contain 'ms'

[Killed] BlockStatement
src/rg/session.ts:138:49
     }
 
     // 4. Session duration
-    if (this._isMaxSessionDurationReached(now)) {
-      return {
-        allow: false,
-        reason: 'max_session_duration',
-        message: 'Session duration limit reached.',
-      };
-    }
+    if (this._isMaxSessionDurationReached(now)) {}
 
     // 5. Session loss limit
killedBy: RG-09: session duration exceeded → refused refuses spin when session duration exceeded
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:138:9
     }
 
     // 4. Session duration
-    if (this._isMaxSessionDurationReached(now)) {
+    if (true) {
       return {
         allow: false,
killedBy: RG-02: not excluded → allow=true allows spin when not self-excluded
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/rg/session.ts:141:17
     if (this._isMaxSessionDurationReached(now)) {
       return {
         allow: false,
-        reason: 'max_session_duration',
+        reason: "",
         message: 'Session duration limit reached.',
       };
killedBy: W239-FINAL — checkSpinAllowed return-shape per branch (lines 74, 99, 111) max session duration reason is exact
statusReason: expected '' to be 'max_session_duration' // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:147:9
     }
 
     // 5. Session loss limit
-    if (this._isMaxLossSessionReached()) {
+    if (false) {
       return {
         allow: false,
killedBy: W239 — maxLossPerSession branches (line 111-112) exact net loss == limit → refused (boundary kills < vs <= mutant)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:147:9
     }
 
     // 5. Session loss limit
-    if (this._isMaxLossSessionReached()) {
+    if (true) {
       return {
         allow: false,
killedBy: RG-02: not excluded → allow=true allows spin when not self-excluded
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:148:14
 
     // 5. Session loss limit
     if (this._isMaxLossSessionReached()) {
-      return {
-        allow: false,
-        reason: 'max_loss_session',
-        message: 'Session loss limit reached.',
-      };
+      return {};
     }
 
killedBy: W239 — maxLossPerSession branches (line 111-112) exact net loss == limit → refused (boundary kills < vs <= mutant)
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:155:21
       };
     }
 
-    return { allow: true };
+    return { allow: false };
   }
 
killedBy: W244 RG-01: maxWagerPerSpin undefined ⇒ no max_wager_exceeded refusal omitting maxWagerPerSpin allows arbitrarily large wagers
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:159:17
   }
 
   recordSpin(wager: number, win: number, nowMs?: number): RGEvent[] {
-    const now = nowMs ?? Date.now();
+    const now = nowMs && Date.now();
     const events: RGEvent[] = [];
 
killedBy: rg-strength: min spin time boundary UKGC: elapsed === minMs → ALLOWED (elapsed < minMs is the refusal predicate)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:163:9
     const events: RGEvent[] = [];
 
     // Lazy-initialize the reality-check baseline to the first spin's timestamp.
-    if (this.lastRealityCheckAt === null) {
+    if (true) {
       this.lastRealityCheckAt = now;
     }
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/rg/session.ts:163:9
     const events: RGEvent[] = [];
 
     // Lazy-initialize the reality-check baseline to the first spin's timestamp.
-    if (this.lastRealityCheckAt === null) {
+    if (this.lastRealityCheckAt !== null) {
       this.lastRealityCheckAt = now;
     }
killedBy: RG-13: reality check fires when interval elapsed emits reality_check_due when interval has elapsed
statusReason: expected undefined not to be undefined

[Killed] AssignmentOperator
src/rg/session.ts:168:5
     }
 
     // Update counters
-    this.totalWagered += wager;
+    this.totalWagered -= wager;
     this.totalWon += win;
     this.netLoss = Math.max(0, this.totalWagered - this.totalWon);
killedBy: RG-07: session loss >= limit → refused refuses spin when netLoss >= maxLossPerSession
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/rg/session.ts:169:5
 
     // Update counters
     this.totalWagered += wager;
-    this.totalWon += win;
+    this.totalWon -= win;
     this.netLoss = Math.max(0, this.totalWagered - this.totalWon);
     this.spinCount += 1;
killedBy: RG-11: recordSpin updates counters correctly increments totalWagered, totalWon, netLoss, spinCount
statusReason: expected -3 to be 3 // Object.is equality

[Killed] MethodExpression
src/rg/session.ts:170:20
     // Update counters
     this.totalWagered += wager;
     this.totalWon += win;
-    this.netLoss = Math.max(0, this.totalWagered - this.totalWon);
+    this.netLoss = Math.min(0, this.totalWagered - this.totalWon);
     this.spinCount += 1;
     this.lastSpinCompletedAt = now;
killedBy: rg-strength: maxLossPerSession boundary netLoss === limit → REFUSED with exact reason
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:170:32
     // Update counters
     this.totalWagered += wager;
     this.totalWon += win;
-    this.netLoss = Math.max(0, this.totalWagered - this.totalWon);
+    this.netLoss = Math.max(0, this.totalWagered + this.totalWon);
     this.spinCount += 1;
     this.lastSpinCompletedAt = now;
killedBy: RG-11: recordSpin updates counters correctly increments totalWagered, totalWon, netLoss, spinCount
statusReason: expected 13 to be 7 // Object.is equality
