[Killed] AssignmentOperator
src/rg/session.ts:171:5
     this.totalWagered += wager;
     this.totalWon += win;
     this.netLoss = Math.max(0, this.totalWagered - this.totalWon);
-    this.spinCount += 1;
+    this.spinCount -= 1;
     this.lastSpinCompletedAt = now;
 
killedBy: W239-FINAL — reality_check_due event detail carries session snapshot (line 203) event detail has all four counters with correct values
statusReason: expected -2 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/rg/session.ts:175:5
     this.lastSpinCompletedAt = now;
 
     // Update AML state
-    this.amlState.totalSpins += 1;
+    this.amlState.totalSpins -= 1;
     this.amlState.recentSpinTimestamps.push(now);
     if (win > 0) {
killedBy: RG-18: AML win-rate sigma flag after 30+ all-win spins emits aml_velocity_flag for win-rate sigma after 30+ consecutive wins
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/rg/session.ts:177:18
     // Update AML state
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
-    if (win > 0) {
-      this.amlState.totalWins += 1;
-      this.amlState.consecutiveWins += 1;
-    } else {
+    if (win > 0) {} else {
       this.amlState.consecutiveWins = 0;
     }
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected 0 to be greater than 0.9

[Killed] ConditionalExpression
src/rg/session.ts:177:9
     // Update AML state
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
-    if (win > 0) {
+    if (false) {
       this.amlState.totalWins += 1;
       this.amlState.consecutiveWins += 1;
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/rg/session.ts:178:7
     this.amlState.totalSpins += 1;
     this.amlState.recentSpinTimestamps.push(now);
     if (win > 0) {
-      this.amlState.totalWins += 1;
+      this.amlState.totalWins -= 1;
       this.amlState.consecutiveWins += 1;
     } else {
killedBy: RG-25: getAMLState returns AML state getAMLState reflects recorded spins and wins
statusReason: expected -1 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/rg/session.ts:179:7
     this.amlState.recentSpinTimestamps.push(now);
     if (win > 0) {
       this.amlState.totalWins += 1;
-      this.amlState.consecutiveWins += 1;
+      this.amlState.consecutiveWins -= 1;
     } else {
       this.amlState.consecutiveWins = 0;
killedBy: rg-strength: consecutiveWins counter win > 0 increments; win === 0 resets to 0
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:180:12
     if (win > 0) {
       this.amlState.totalWins += 1;
       this.amlState.consecutiveWins += 1;
-    } else {
-      this.amlState.consecutiveWins = 0;
-    }
+    } else {}
 
     // AML velocity: sliding 60s window
killedBy: rg-strength: consecutiveWins counter win > 0 increments; win === 0 resets to 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:185:25
     }
 
     // AML velocity: sliding 60s window
-    const windowStart = now - 60_000;
+    const windowStart = now + 60_000;
     this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps.filter(
       (ts) => ts > windowStart,
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/rg/session.ts:186:42
 
     // AML velocity: sliding 60s window
     const windowStart = now - 60_000;
-    this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps.filter(
-      (ts) => ts > windowStart,
-    );
+    this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps;
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
killedBy: W239 — AML velocity window filter boundary (line 153) timestamp exactly at windowStart is filtered OUT (strict > comparator)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:187:15
     // AML velocity: sliding 60s window
     const windowStart = now - 60_000;
     this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps.filter(
-      (ts) => ts > windowStart,
+      (ts) => ts >= windowStart,
     );
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
killedBy: W239 — AML velocity window filter boundary (line 153) timestamp exactly at windowStart is filtered OUT (strict > comparator)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/rg/session.ts:187:7
     // AML velocity: sliding 60s window
     const windowStart = now - 60_000;
     this.amlState.recentSpinTimestamps = this.amlState.recentSpinTimestamps.filter(
-      (ts) => ts > windowStart,
+      () => undefined,
     );
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/rg/session.ts:191:9
     );
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
-    if (this._shouldFireAmlVelocity(spinsInWindow)) {
+    if (true) {
       this.amlVelocityFired = true;
       this.amlState.flagged = true;
killedBy: W239 — AML velocity window filter boundary (line 153) timestamp exactly at windowStart is filtered OUT (strict > comparator)
statusReason: expected 4 to be +0 // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:191:53
     );
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
-    if (this._shouldFireAmlVelocity(spinsInWindow)) {
-      this.amlVelocityFired = true;
-      this.amlState.flagged = true;
-      this.amlState.flagReason = 'velocity';
-      const event: RGEvent = {
-        kind: 'aml_velocity_flag',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: { spinsInWindow, maxSpinsPerMinute },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    if (this._shouldFireAmlVelocity(spinsInWindow)) {}
 
     // AML win-rate sigma: after 30+ spins
killedBy: RG-16: AML velocity flag fires when spins/min exceeded emits aml_velocity_flag when spins exceed maxSpinsPerMinute
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:192:31
     const spinsInWindow = this.amlState.recentSpinTimestamps.length;
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (this._shouldFireAmlVelocity(spinsInWindow)) {
-      this.amlVelocityFired = true;
+      this.amlVelocityFired = false;
       this.amlState.flagged = true;
       this.amlState.flagReason = 'velocity';
killedBy: rg-strength: AML velocity flag velocity flag fires ONCE then suppressed
statusReason: expected 8 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:193:31
     const maxSpinsPerMinute = this.amlConfig.maxSpinsPerMinute;
     if (this._shouldFireAmlVelocity(spinsInWindow)) {
       this.amlVelocityFired = true;
-      this.amlState.flagged = true;
+      this.amlState.flagged = false;
       this.amlState.flagReason = 'velocity';
       const event: RGEvent = {
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:195:30
       this.amlVelocityFired = true;
       this.amlState.flagged = true;
       this.amlState.flagReason = 'velocity';
-      const event: RGEvent = {
-        kind: 'aml_velocity_flag',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: { spinsInWindow, maxSpinsPerMinute },
-      };
+      const event: RGEvent = {};
       events.push(event);
       this.eventLog.push(event);
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
src/rg/session.ts:206:39
     }
 
     // AML win-rate sigma: after 30+ spins
-    if (this._isAmlWinRateGateOpen()) {
-      const n = this.amlState.totalSpins;
-      const p = 0.35; // expected win rate
-      const actualRate = this.amlState.totalWins / n;
-      const stdErr = Math.sqrt((p * (1 - p)) / n);
-      const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
-        this.amlWinRateFired = true;
-        this.amlState.flagged = true;
-        this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
-        const event: RGEvent = {
-          kind: 'aml_velocity_flag',
-          sessionId: this.sessionId,
-          timestamp: now,
-          detail: { actualRate, expectedRate: p, sigma, threshold: this.amlConfig.winRateSigmaThreshold },
-        };
-        events.push(event);
-        this.eventLog.push(event);
-      }
-    }
+    if (this._isAmlWinRateGateOpen()) {}
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
killedBy: W239 — win-rate sigma arithmetic shape (lines 184-185) actual win rate is computed as wins / spins (kills + → -)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:206:9
     }
 
     // AML win-rate sigma: after 30+ spins
-    if (this._isAmlWinRateGateOpen()) {
+    if (false) {
       const n = this.amlState.totalSpins;
       const p = 0.35; // expected win rate
killedBy: W239-FINAL — winRateFired idempotency over a long sequence (line 188) flag survives 100 additional sigma-triggering spins after first fire
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:209:26
     if (this._isAmlWinRateGateOpen()) {
       const n = this.amlState.totalSpins;
       const p = 0.35; // expected win rate
-      const actualRate = this.amlState.totalWins / n;
+      const actualRate = this.amlState.totalWins * n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
killedBy: rg-strength: AML win-rate sigma moderate win rate within sigma threshold → no flag
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:210:33
       const n = this.amlState.totalSpins;
       const p = 0.35; // expected win rate
       const actualRate = this.amlState.totalWins / n;
-      const stdErr = Math.sqrt((p * (1 - p)) / n);
+      const stdErr = Math.sqrt((p / (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
killedBy: W239 — win-rate sigma arithmetic shape (lines 184-185) actual win rate is computed as wins / spins (kills + → -)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:210:38
       const n = this.amlState.totalSpins;
       const p = 0.35; // expected win rate
       const actualRate = this.amlState.totalWins / n;
-      const stdErr = Math.sqrt((p * (1 - p)) / n);
+      const stdErr = Math.sqrt((p * (1 + p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
killedBy: W239 — win-rate sigma arithmetic shape (lines 184-185) actual win rate is computed as wins / spins (kills + → -)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:211:21
       const p = 0.35; // expected win rate
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
-      const sigma = Math.abs(actualRate - p) / stdErr;
+      const sigma = Math.abs(actualRate - p) * stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
         this.amlWinRateFired = true;
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] ArithmeticOperator
src/rg/session.ts:211:30
       const p = 0.35; // expected win rate
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
-      const sigma = Math.abs(actualRate - p) / stdErr;
+      const sigma = Math.abs(actualRate + p) / stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
         this.amlWinRateFired = true;
killedBy: W239 — win-rate sigma arithmetic shape (lines 184-185) actual win rate is computed as wins / spins (kills + → -)
statusReason: expected 12.057554287027505 to be less than 4.5

[Killed] ConditionalExpression
src/rg/session.ts:212:11
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
+      if (false) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/rg/session.ts:212:11
       const actualRate = this.amlState.totalWins / n;
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
-      if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
+      if (sigma <= (this.amlConfig.winRateSigmaThreshold as number)) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] BooleanLiteral
src/rg/session.ts:213:32
       const stdErr = Math.sqrt((p * (1 - p)) / n);
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
-        this.amlWinRateFired = true;
+        this.amlWinRateFired = false;
         this.amlState.flagged = true;
         this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
killedBy: W239 — winRateFired idempotency (line 187) extra spins after sigma flag do not produce a second flag event
statusReason: expected 31 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:214:33
       const sigma = Math.abs(actualRate - p) / stdErr;
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
         this.amlWinRateFired = true;
-        this.amlState.flagged = true;
+        this.amlState.flagged = false;
         this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
         const event: RGEvent = {
killedBy: W244 RG-07: AML win-rate gate fires exactly when conditions met ≥ 30 spins with skewed wins ⇒ flagged becomes true (kills BooleanLiteral mutant)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:215:36
       if (sigma > (this.amlConfig.winRateSigmaThreshold as number)) {
         this.amlWinRateFired = true;
         this.amlState.flagged = true;
-        this.amlState.flagReason = this.amlState.flagReason ?? 'win_rate_sigma';
+        this.amlState.flagReason = this.amlState.flagReason && 'win_rate_sigma';
         const event: RGEvent = {
           kind: 'aml_velocity_flag',
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined to be 'win_rate_sigma' // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:228:44
     }
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
-    if (this._shouldFireRealityCheck(now)) {
-      this.lastRealityCheckAt = now;
-      const event: RGEvent = {
-        kind: 'reality_check_due',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: {
-          totalWagered: this.totalWagered,
-          totalWon: this.totalWon,
-          netLoss: this.netLoss,
-          spinCount: this.spinCount,
-        },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    if (this._shouldFireRealityCheck(now)) {}
 
     // Session limit warning at 80%
killedBy: W239 — lazy reality-check init (line 129) reality check at exact interval updates lastRealityCheckAt to fire time
statusReason: expected 2000000 to be 2060000 // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:228:9
     }
 
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
-    if (this._shouldFireRealityCheck(now)) {
+    if (false) {
       this.lastRealityCheckAt = now;
       const event: RGEvent = {
killedBy: W239-FINAL — reality_check_due event detail carries session snapshot (line 203) event detail has all four counters with correct values
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:230:30
     // Reality check (lastRealityCheckAt is non-null here — initialized above)
     if (this._shouldFireRealityCheck(now)) {
       this.lastRealityCheckAt = now;
-      const event: RGEvent = {
-        kind: 'reality_check_due',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: {
-          totalWagered: this.totalWagered,
-          totalWon: this.totalWon,
-          netLoss: this.netLoss,
-          spinCount: this.spinCount,
-        },
-      };
+      const event: RGEvent = {};
       events.push(event);
       this.eventLog.push(event);
killedBy: rg-strength: reality check interval elapsed === interval → event fires with full detail
statusReason: expected undefined not to be undefined

[Killed] ObjectLiteral
src/rg/session.ts:234:17
         kind: 'reality_check_due',
         sessionId: this.sessionId,
         timestamp: now,
-        detail: {
-          totalWagered: this.totalWagered,
-          totalWon: this.totalWon,
-          netLoss: this.netLoss,
-          spinCount: this.spinCount,
-        },
+        detail: {},
       };
       events.push(event);
killedBy: W239-FINAL — reality_check_due event detail carries session snapshot (line 203) event detail has all four counters with correct values
statusReason: expected undefined to be 30 // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:246:48
     }
 
     // Session limit warning at 80%
-    if (this._shouldFireSessionLimitWarning()) {
-      const event: RGEvent = {
-        kind: 'session_limit_warning',
-        sessionId: this.sessionId,
-        timestamp: now,
-        detail: {
-          netLoss: this.netLoss,
-          limit: this.limits.maxLossPerSession,
-          pct: this.netLoss / (this.limits.maxLossPerSession as number),
-        },
-      };
-      events.push(event);
-      this.eventLog.push(event);
-    }
+    if (this._shouldFireSessionLimitWarning()) {}
 
     return events;
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.80 → warning fires with exact pct
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/rg/session.ts:246:9
     }
 
     // Session limit warning at 80%
-    if (this._shouldFireSessionLimitWarning()) {
+    if (true) {
       const event: RGEvent = {
         kind: 'session_limit_warning',
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.79 → no warning
statusReason: expected { kind: 'session_limit_warning', …(3) } to be undefined

[Killed] ObjectLiteral
src/rg/session.ts:251:17
         kind: 'session_limit_warning',
         sessionId: this.sessionId,
         timestamp: now,
-        detail: {
-          netLoss: this.netLoss,
-          limit: this.limits.maxLossPerSession,
-          pct: this.netLoss / (this.limits.maxLossPerSession as number),
-        },
+        detail: {},
       };
       events.push(event);
killedBy: W239-FINAL — session_limit_warning event detail (line 224) warning carries netLoss + limit + pct in detail
statusReason: expected undefined to be 900 // Object.is equality

[Killed] ArithmeticOperator
src/rg/session.ts:254:16
         detail: {
           netLoss: this.netLoss,
           limit: this.limits.maxLossPerSession,
-          pct: this.netLoss / (this.limits.maxLossPerSession as number),
+          pct: this.netLoss * (this.limits.maxLossPerSession as number),
         },
       };
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.80 → warning fires with exact pct
statusReason: expected { netLoss: 80, limit: 100, pct: 8000 } to deeply equal { netLoss: 80, limit: 100, pct: 0.8 }

[Killed] BlockStatement
src/rg/session.ts:271:66
   // single arithmetic expression with no embedded `if`.
 
   /** AML velocity fire iff not yet fired AND cap is configured AND threshold exceeded. */
-  private _shouldFireAmlVelocity(spinsInWindow: number): boolean {
-    return !this.amlVelocityFired
-      && spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
-  }
+  private _shouldFireAmlVelocity(spinsInWindow: number): boolean {}
 
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/rg/session.ts:272:12
 
   /** AML velocity fire iff not yet fired AND cap is configured AND threshold exceeded. */
   private _shouldFireAmlVelocity(spinsInWindow: number): boolean {
-    return !this.amlVelocityFired
+    return this.amlVelocityFired
       && spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
   }
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/rg/session.ts:272:12
 
   /** AML velocity fire iff not yet fired AND cap is configured AND threshold exceeded. */
   private _shouldFireAmlVelocity(spinsInWindow: number): boolean {
-    return !this.amlVelocityFired
-      && spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
+    return !this.amlVelocityFired || spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
   }
 
killedBy: rg-strength: AML velocity flag exactly maxSpinsPerMinute spins in window → NO flag
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:273:10
   /** AML velocity fire iff not yet fired AND cap is configured AND threshold exceeded. */
   private _shouldFireAmlVelocity(spinsInWindow: number): boolean {
     return !this.amlVelocityFired
-      && spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
+      && spinsInWindow >= (this.amlConfig.maxSpinsPerMinute ?? Infinity);
   }
 
killedBy: W239 — AML velocity window filter boundary (line 153) timestamp exactly at windowStart is filtered OUT (strict > comparator)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:273:27
   /** AML velocity fire iff not yet fired AND cap is configured AND threshold exceeded. */
   private _shouldFireAmlVelocity(spinsInWindow: number): boolean {
     return !this.amlVelocityFired
-      && spinsInWindow > (this.amlConfig.maxSpinsPerMinute ?? Infinity);
+      && spinsInWindow > (this.amlConfig.maxSpinsPerMinute && Infinity);
   }
 
killedBy: rg-strength: AML velocity flag maxSpinsPerMinute+1 spins → flag fires with exact kind + detail
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/rg/session.ts:277:44
   }
 
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
-  private _isAmlWinRateGateOpen(): boolean {
-    return !this.amlWinRateFired
-      && this.amlState.totalSpins >= 30
-      && this.amlConfig.winRateSigmaThreshold !== undefined;
-  }
+  private _isAmlWinRateGateOpen(): boolean {}
 
   /** Reality-check fires iff interval is configured AND interval has elapsed since last check. */
killedBy: W244 RG-07: AML win-rate gate fires exactly when conditions met ≥ 30 spins with skewed wins ⇒ flagged becomes true (kills BooleanLiteral mutant)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:278:12
 
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
   private _isAmlWinRateGateOpen(): boolean {
-    return !this.amlWinRateFired
+    return this.amlWinRateFired
       && this.amlState.totalSpins >= 30
       && this.amlConfig.winRateSigmaThreshold !== undefined;
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] LogicalOperator
src/rg/session.ts:278:12
 
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
   private _isAmlWinRateGateOpen(): boolean {
-    return !this.amlWinRateFired
-      && this.amlState.totalSpins >= 30
-      && this.amlConfig.winRateSigmaThreshold !== undefined;
+    return !this.amlWinRateFired && this.amlState.totalSpins >= 30 || this.amlConfig.winRateSigmaThreshold !== undefined;
   }
 
killedBy: rg-strength: AML win-rate sigma totalSpins === 29 (< 30) → no sigma check fires
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:279:10
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
   private _isAmlWinRateGateOpen(): boolean {
     return !this.amlWinRateFired
-      && this.amlState.totalSpins >= 30
+      && this.amlState.totalSpins > 30
       && this.amlConfig.winRateSigmaThreshold !== undefined;
   }
killedBy: rg-strength: AML win-rate sigma totalSpins === 30 + extreme win rate → fires with exact kind
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
src/rg/session.ts:279:10
   /** AML win-rate gate opens iff not yet fired AND ≥30 spins AND threshold configured. */
   private _isAmlWinRateGateOpen(): boolean {
     return !this.amlWinRateFired
-      && this.amlState.totalSpins >= 30
+      && this.amlState.totalSpins < 30
       && this.amlConfig.winRateSigmaThreshold !== undefined;
   }
killedBy: rg-strength: AML win-rate sigma totalSpins === 29 (< 30) → no sigma check fires
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:280:10
   private _isAmlWinRateGateOpen(): boolean {
     return !this.amlWinRateFired
       && this.amlState.totalSpins >= 30
-      && this.amlConfig.winRateSigmaThreshold !== undefined;
+      && this.amlConfig.winRateSigmaThreshold === undefined;
   }
 
killedBy: W244 RG-07: AML win-rate gate fires exactly when conditions met ≥ 30 spins with skewed wins ⇒ flagged becomes true (kills BooleanLiteral mutant)
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/rg/session.ts:280:10
   private _isAmlWinRateGateOpen(): boolean {
     return !this.amlWinRateFired
       && this.amlState.totalSpins >= 30
-      && this.amlConfig.winRateSigmaThreshold !== undefined;
+      && true;
   }
 

[Killed] BlockStatement
src/rg/session.ts:284:57
   }
 
   /** Reality-check fires iff interval is configured AND interval has elapsed since last check. */
-  private _shouldFireRealityCheck(now: number): boolean {
-    // lastRealityCheckAt is non-null at every call site (lazy-init above).
-    const interval = this.limits.realityCheckIntervalMs ?? Infinity;
-    return now - (this.lastRealityCheckAt as number) >= interval;
-  }
+  private _shouldFireRealityCheck(now: number): boolean {}
 
   /** Session-limit warning fires iff cap configured AND netLoss ≥ 80 % of cap. */
killedBy: rg-strength: reality check interval elapsed === interval → event fires with full detail
statusReason: expected undefined not to be undefined

[Killed] LogicalOperator
src/rg/session.ts:286:22
   /** Reality-check fires iff interval is configured AND interval has elapsed since last check. */
   private _shouldFireRealityCheck(now: number): boolean {
     // lastRealityCheckAt is non-null at every call site (lazy-init above).
-    const interval = this.limits.realityCheckIntervalMs ?? Infinity;
+    const interval = this.limits.realityCheckIntervalMs && Infinity;
     return now - (this.lastRealityCheckAt as number) >= interval;
   }
killedBy: rg-strength: reality check interval elapsed === interval → event fires with full detail
statusReason: expected undefined not to be undefined

[Killed] ArithmeticOperator
src/rg/session.ts:287:12
   private _shouldFireRealityCheck(now: number): boolean {
     // lastRealityCheckAt is non-null at every call site (lazy-init above).
     const interval = this.limits.realityCheckIntervalMs ?? Infinity;
-    return now - (this.lastRealityCheckAt as number) >= interval;
+    return now + (this.lastRealityCheckAt as number) >= interval;
   }
 
killedBy: rg-strength: reality check interval elapsed === interval-1 → no event
statusReason: expected { kind: 'reality_check_due', …(3) } to be undefined
