[Killed] EqualityOperator
src/rg/session.ts:287:12
   private _shouldFireRealityCheck(now: number): boolean {
     // lastRealityCheckAt is non-null at every call site (lazy-init above).
     const interval = this.limits.realityCheckIntervalMs ?? Infinity;
-    return now - (this.lastRealityCheckAt as number) >= interval;
+    return now - (this.lastRealityCheckAt as number) < interval;
   }
 
killedBy: W244 RG-08: realityCheck event suppressed when interval undefined no reality_check_due event when realityCheckIntervalMs unset
statusReason: expected { kind: 'reality_check_due', …(3) } to be undefined

[Killed] BlockStatement
src/rg/session.ts:291:53
   }
 
   /** Session-limit warning fires iff cap configured AND netLoss ≥ 80 % of cap. */
-  private _shouldFireSessionLimitWarning(): boolean {
-    const cap = this.limits.maxLossPerSession ?? Infinity;
-    return this.netLoss >= cap * 0.8;
-  }
+  private _shouldFireSessionLimitWarning(): boolean {}
 
   getState(): Readonly<RGSessionState> {
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.80 → warning fires with exact pct
statusReason: expected undefined not to be undefined

[Killed] LogicalOperator
src/rg/session.ts:292:17
 
   /** Session-limit warning fires iff cap configured AND netLoss ≥ 80 % of cap. */
   private _shouldFireSessionLimitWarning(): boolean {
-    const cap = this.limits.maxLossPerSession ?? Infinity;
+    const cap = this.limits.maxLossPerSession && Infinity;
     return this.netLoss >= cap * 0.8;
   }
killedBy: W239-FINAL — session_limit_warning event detail (line 224) warning carries netLoss + limit + pct in detail
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/rg/session.ts:293:12
   /** Session-limit warning fires iff cap configured AND netLoss ≥ 80 % of cap. */
   private _shouldFireSessionLimitWarning(): boolean {
     const cap = this.limits.maxLossPerSession ?? Infinity;
-    return this.netLoss >= cap * 0.8;
+    return this.netLoss < cap * 0.8;
   }
 
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.80 → warning fires with exact pct
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
src/rg/session.ts:293:12
   /** Session-limit warning fires iff cap configured AND netLoss ≥ 80 % of cap. */
   private _shouldFireSessionLimitWarning(): boolean {
     const cap = this.limits.maxLossPerSession ?? Infinity;
-    return this.netLoss >= cap * 0.8;
+    return false;
   }
 
killedBy: rg-strength: session limit warning at 80% netLoss === limit * 0.80 → warning fires with exact pct
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
src/rg/session.ts:296:40
     return this.netLoss >= cap * 0.8;
   }
 
-  getState(): Readonly<RGSessionState> {
-    return {
-      sessionId: this.sessionId,
-      startTime: this.startTime,
-      totalWagered: this.totalWagered,
-      totalWon: this.totalWon,
-      netLoss: this.netLoss,
-      spinCount: this.spinCount,
-      lastRealityCheckAt: this.lastRealityCheckAt ?? this.startTime,
-      jurisdiction: this.jurisdiction,
-      limits: { ...this.limits },
-    };
-  }
+  getState(): Readonly<RGSessionState> {}
 
   /** AML cash-out hold required iff threshold configured AND amount ≥ threshold. */
killedBy: rg-strength: getState invariants fresh session: all counters zero, lastRealityCheckAt === startTime
statusReason: Cannot read properties of undefined (reading 'totalWagered')

[Killed] ObjectLiteral
src/rg/session.ts:297:12
   }
 
   getState(): Readonly<RGSessionState> {
-    return {
-      sessionId: this.sessionId,
-      startTime: this.startTime,
-      totalWagered: this.totalWagered,
-      totalWon: this.totalWon,
-      netLoss: this.netLoss,
-      spinCount: this.spinCount,
-      lastRealityCheckAt: this.lastRealityCheckAt ?? this.startTime,
-      jurisdiction: this.jurisdiction,
-      limits: { ...this.limits },
-    };
+    return {};
   }
 
killedBy: W239 — uuid uniqueness (line 13) two consecutive sessions produce different sessionIds
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:304:27
       totalWon: this.totalWon,
       netLoss: this.netLoss,
       spinCount: this.spinCount,
-      lastRealityCheckAt: this.lastRealityCheckAt ?? this.startTime,
+      lastRealityCheckAt: this.lastRealityCheckAt && this.startTime,
       jurisdiction: this.jurisdiction,
       limits: { ...this.limits },
killedBy: rg-strength: getState invariants fresh session: all counters zero, lastRealityCheckAt === startTime
statusReason: expected null to be 12345 // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:306:15
       spinCount: this.spinCount,
       lastRealityCheckAt: this.lastRealityCheckAt ?? this.startTime,
       jurisdiction: this.jurisdiction,
-      limits: { ...this.limits },
+      limits: {},
     };
   }
killedBy: rg-strength: getState invariants limits are deep-cloned (state is read-only snapshot)
statusReason: expected {} to deeply equal { maxWagerPerSpin: 50, …(1) }

[Killed] BlockStatement
src/rg/session.ts:311:55
   }
 
   /** AML cash-out hold required iff threshold configured AND amount ≥ threshold. */
-  private _shouldHoldCashOut(amount: number): boolean {
-    return amount >= (this.amlConfig.cashOutHoldThreshold ?? Infinity);
-  }
+  private _shouldHoldCashOut(amount: number): boolean {}
 
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
killedBy: rg-strength: cash-out hold threshold amount === threshold → required=true with exact reason
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/rg/session.ts:312:23
 
   /** AML cash-out hold required iff threshold configured AND amount ≥ threshold. */
   private _shouldHoldCashOut(amount: number): boolean {
-    return amount >= (this.amlConfig.cashOutHoldThreshold ?? Infinity);
+    return amount >= (this.amlConfig.cashOutHoldThreshold && Infinity);
   }
 
killedBy: rg-strength: cash-out hold threshold amount === threshold → required=true with exact reason
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rg/session.ts:312:12
 
   /** AML cash-out hold required iff threshold configured AND amount ≥ threshold. */
   private _shouldHoldCashOut(amount: number): boolean {
-    return amount >= (this.amlConfig.cashOutHoldThreshold ?? Infinity);
+    return amount > (this.amlConfig.cashOutHoldThreshold ?? Infinity);
   }
 
killedBy: rg-strength: cash-out hold threshold amount === threshold → required=true with exact reason
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:315:79
     return amount >= (this.amlConfig.cashOutHoldThreshold ?? Infinity);
   }
 
-  cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
-    if (this._shouldHoldCashOut(amount)) {
-      const threshold = this.amlConfig.cashOutHoldThreshold as number;
-      return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
-    }
-    return { required: false };
-  }
+  cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {}
 
   getEventLog(): readonly RGEvent[] {
killedBy: W239 — cashOutHoldRequired branches (line 260) threshold undefined → never required
statusReason: Cannot read properties of undefined (reading 'required')

[Killed] ConditionalExpression
src/rg/session.ts:316:9
   }
 
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
-    if (this._shouldHoldCashOut(amount)) {
+    if (true) {
       const threshold = this.amlConfig.cashOutHoldThreshold as number;
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
killedBy: W239-FINAL — cashOutHoldRequired exact reason string (line 260) not-required path has NO reason field
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rg/session.ts:316:9
   }
 
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
-    if (this._shouldHoldCashOut(amount)) {
+    if (false) {
       const threshold = this.amlConfig.cashOutHoldThreshold as number;
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
killedBy: rg-strength: cash-out hold threshold amount === threshold → required=true with exact reason
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:318:26
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
     if (this._shouldHoldCashOut(amount)) {
       const threshold = this.amlConfig.cashOutHoldThreshold as number;
-      return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
+      return { required: false, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
     return { required: false };
killedBy: W239-FINAL — cashOutHoldRequired exact reason string (line 260) required path carries threshold value in the reason text
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/rg/session.ts:318:14
   cashOutHoldRequired(amount: number): { required: boolean; reason?: string } {
     if (this._shouldHoldCashOut(amount)) {
       const threshold = this.amlConfig.cashOutHoldThreshold as number;
-      return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
+      return {};
     }
     return { required: false };
killedBy: W239 — cashOutHoldRequired branches (line 260) amount exactly at threshold → required (kills > vs >= mutant)
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/rg/session.ts:320:24
       const threshold = this.amlConfig.cashOutHoldThreshold as number;
       return { required: true, reason: `Cash-out amount ${amount} meets AML hold threshold ${threshold}.` };
     }
-    return { required: false };
+    return { required: true };
   }
 
killedBy: W239 — cashOutHoldRequired branches (line 260) threshold undefined → never required
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rg/session.ts:323:37
     return { required: false };
   }
 
-  getEventLog(): readonly RGEvent[] {
-    return this.eventLog;
-  }
+  getEventLog(): readonly RGEvent[] {}
 
   getAMLState(): Readonly<AMLState> {
killedBy: W239-FINAL — sigma `>` strict boundary (line 186) actualRate that yields sigma == threshold exactly does NOT fire
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/rg/session.ts:327:37
     return this.eventLog;
   }
 
-  getAMLState(): Readonly<AMLState> {
-    return { ...this.amlState, recentSpinTimestamps: [...this.amlState.recentSpinTimestamps] };
-  }
+  getAMLState(): Readonly<AMLState> {}
 }
 
killedBy: rg-strength: AML velocity flag exactly maxSpinsPerMinute spins in window → NO flag
statusReason: Cannot read properties of undefined (reading 'flagged')

[Killed] ArrayDeclaration
src/rg/session.ts:328:54
   }
 
   getAMLState(): Readonly<AMLState> {
-    return { ...this.amlState, recentSpinTimestamps: [...this.amlState.recentSpinTimestamps] };
+    return { ...this.amlState, recentSpinTimestamps: [] };
   }
 }
killedBy: W239 — recentSpinTimestamps starts empty (line 43) after one spin, the array contains exactly that one timestamp
statusReason: expected [] to deeply equal [ 2000000 ]

[Killed] ObjectLiteral
src/rg/session.ts:328:12
   }
 
   getAMLState(): Readonly<AMLState> {
-    return { ...this.amlState, recentSpinTimestamps: [...this.amlState.recentSpinTimestamps] };
+    return {};
   }
 }
killedBy: rg-strength: AML velocity flag exactly maxSpinsPerMinute spins in window → NO flag
statusReason: expected undefined to be false // Object.is equality
