[Killed] BlockStatement
src/sensitivity/analyzer.ts:23:15
   symbolId: string,
   reelIndices: number[],
   multiplier: number,
-): SlotGameIR {
-  const clone = JSON.parse(JSON.stringify(ir)) as SlotGameIR;
-
-  if (clone.reels.mode !== 'weighted') return clone;
-
-  const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
-  const reelSet = new Set(reelIndices);
-
-  // W244 wave 8 — `for...of entries()` umesto `for (let i = 0; i < len; i++)`
-  // eliminiše Stryker EqualityOperator `<` → `<=` mutant na loop kondiciji
-  // (mutant je bio death-equivalent jer `reels.base[len]` je `undefined`
-  // što je `if (!reelMap) continue` neutralizovao). Sparse-array guard
-  // (`if (!reelMap) continue`) ostaje — testovi pin-uju da se rupa u
-  // `reels.base[i]` ne baci. `for...of entries()` yield-uje `[i, undefined]`
-  // za sparse holes, ne preskače ih.
-  for (const [i, reelMap] of reels.base.entries()) {
-    if (!reelSet.has(i)) continue;
-    if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
-    const current = reelMap[symbolId] ?? 1;
-    reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
-  }
-
-  return clone;
-}
+): SlotGameIR {}
 
 // W244 wave 8 — extracted bisection-boundary guards so Stryker mutates a
killedBy: W239-FINAL — applyWeightMultiplier reel-loop strict `<` (line 31) out-of-bounds index N is never touched (kills `<=` mutant via crash)
statusReason: Cannot read properties of undefined (reading 'reels')

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:26:7
 ): SlotGameIR {
   const clone = JSON.parse(JSON.stringify(ir)) as SlotGameIR;
 
-  if (clone.reels.mode !== 'weighted') return clone;
+  if (clone.reels.mode === 'weighted') return clone;
 
   const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
killedBy: W239 — applyWeightMultiplier reel-loop bound (L31) mutating ALL reel indices touches every reel (len-1 must be included)
statusReason: expected 10 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:26:7
 ): SlotGameIR {
   const clone = JSON.parse(JSON.stringify(ir)) as SlotGameIR;
 
-  if (clone.reels.mode !== 'weighted') return clone;
+  if (true) return clone;
 
   const reels = clone.reels as Extract<typeof clone.reels, { mode: 'weighted' }>;
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with wild as last symbol still finds and uses it
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:38:52
   // (`if (!reelMap) continue`) ostaje — testovi pin-uju da se rupa u
   // `reels.base[i]` ne baci. `for...of entries()` yield-uje `[i, undefined]`
   // za sparse holes, ne preskače ih.
-  for (const [i, reelMap] of reels.base.entries()) {
-    if (!reelSet.has(i)) continue;
-    if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
-    const current = reelMap[symbolId] ?? 1;
-    reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
-  }
+  for (const [i, reelMap] of reels.base.entries()) {}
 
   return clone;
killedBy: W239 — applyWeightMultiplier reel-loop bound (L31) mutating ALL reel indices touches every reel (len-1 must be included)
statusReason: expected 10 to be 30 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:39:9
   // `reels.base[i]` ne baci. `for...of entries()` yield-uje `[i, undefined]`
   // za sparse holes, ne preskače ih.
   for (const [i, reelMap] of reels.base.entries()) {
-    if (!reelSet.has(i)) continue;
+    if (false) continue;
     if (!reelMap) continue;
     if (!(symbolId in reelMap)) continue;
killedBy: MUT-AWM-02: applyWeightMultiplier — reel-index loop boundary (line 31 EqualityOperator: < vs <=) out-of-range index does NOT touch reel.length position
statusReason: expected 50 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:39:9
   // `reels.base[i]` ne baci. `for...of entries()` yield-uje `[i, undefined]`
   // za sparse holes, ne preskače ih.
   for (const [i, reelMap] of reels.base.entries()) {
-    if (!reelSet.has(i)) continue;
+    if (true) continue;
     if (!reelMap) continue;
     if (!(symbolId in reelMap)) continue;
killedBy: W239-FINAL — applyWeightMultiplier reel-loop strict `<` (line 31) out-of-bounds index N is never touched (kills `<=` mutant via crash)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:40:9
   // za sparse holes, ne preskače ih.
   for (const [i, reelMap] of reels.base.entries()) {
     if (!reelSet.has(i)) continue;
-    if (!reelMap) continue;
+    if (false) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
killedBy: W239 — applyWeightMultiplier missing-reelMap guard (L34) reelSet entry that resolves to no map is skipped silently
statusReason: Cannot use 'in' operator to search for 'S_A' in null

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:40:9
   // za sparse holes, ne preskače ih.
   for (const [i, reelMap] of reels.base.entries()) {
     if (!reelSet.has(i)) continue;
-    if (!reelMap) continue;
+    if (reelMap) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with wild as last symbol still finds and uses it
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:41:9
   for (const [i, reelMap] of reels.base.entries()) {
     if (!reelSet.has(i)) continue;
     if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
+    if (symbolId in reelMap) continue;
     const current = reelMap[symbolId] ?? 1;
     reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
killedBy: W239-FINAL — applyWeightMultiplier reel-loop strict `<` (line 31) out-of-bounds index N is never touched (kills `<=` mutant via crash)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:41:9
   for (const [i, reelMap] of reels.base.entries()) {
     if (!reelSet.has(i)) continue;
     if (!reelMap) continue;
-    if (!(symbolId in reelMap)) continue;
+    if (true) continue;
     const current = reelMap[symbolId] ?? 1;
     reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
killedBy: W239-FINAL — applyWeightMultiplier reel-loop strict `<` (line 31) out-of-bounds index N is never touched (kills `<=` mutant via crash)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:42:21
     if (!reelSet.has(i)) continue;
     if (!reelMap) continue;
     if (!(symbolId in reelMap)) continue;
-    const current = reelMap[symbolId] ?? 1;
+    const current = reelMap[symbolId] && 1;
     reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
   }
killedBy: W239 — applyWeightMultiplier reel-loop bound (L31) mutating ALL reel indices touches every reel (len-1 must be included)
statusReason: expected 3 to be 30 // Object.is equality

[Killed] MethodExpression
src/sensitivity/analyzer.ts:43:25
     if (!reelMap) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
-    reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
+    reelMap[symbolId] = Math.min(1, Math.round(current * multiplier));
   }
 
killedBy: W239 — applyWeightMultiplier reel-loop bound (L31) mutating ALL reel indices touches every reel (len-1 must be included)
statusReason: expected 1 to be 30 // Object.is equality

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:43:48
     if (!reelMap) continue;
     if (!(symbolId in reelMap)) continue;
     const current = reelMap[symbolId] ?? 1;
-    reelMap[symbolId] = Math.max(1, Math.round(current * multiplier));
+    reelMap[symbolId] = Math.max(1, Math.round(current / multiplier));
   }
 
killedBy: W239 — applyWeightMultiplier reel-loop bound (L31) mutating ALL reel indices touches every reel (len-1 must be included)
statusReason: expected 3 to be 30 // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:61:74
 // Exported so direct unit tests can pin the strict-inequality semantics
 // independently of the bisection loop's end-to-end behavior. The W244 wave 8
 // killer suite (tests/w244_stryker_99_killers.test.ts) imports both.
-export function _hasConverged(error: number, tolerance: number): boolean {
-  return error < tolerance;
-}
+export function _hasConverged(error: number, tolerance: number): boolean {}
 
 export function _needsHigherWeights(achievedRtp: number, targetRtp: number): boolean {
killedBy: W239 — solveTargetRtp error arithmetic & convergence boundary (L170-177) convergence requires error < tolerance, not <= (strict equality kill)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:62:10
 // independently of the bisection loop's end-to-end behavior. The W244 wave 8
 // killer suite (tests/w244_stryker_99_killers.test.ts) imports both.
 export function _hasConverged(error: number, tolerance: number): boolean {
-  return error < tolerance;
+  return error >= tolerance;
 }
 
killedBy: W239 — solveTargetRtp error arithmetic & convergence boundary (L170-177) convergence requires error < tolerance, not <= (strict equality kill)
statusReason: expected 12.75 to be less than 10

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:62:10
 // independently of the bisection loop's end-to-end behavior. The W244 wave 8
 // killer suite (tests/w244_stryker_99_killers.test.ts) imports both.
 export function _hasConverged(error: number, tolerance: number): boolean {
-  return error < tolerance;
+  return error <= tolerance;
 }
 
killedBy: W244-W8 SENS-helper unit: `_hasConverged` strict `<` semantics returns FALSE when error EQUALS tolerance (boundary)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:65:86
   return error < tolerance;
 }
 
-export function _needsHigherWeights(achievedRtp: number, targetRtp: number): boolean {
-  return achievedRtp < targetRtp;
-}
+export function _needsHigherWeights(achievedRtp: number, targetRtp: number): boolean {}
 
 // ─── analyzeSensitivity ───────────────────────────────────────────────────
killedBy: analyzer-strength: solveTargetRtp bisection achievedRtp < target → lo moves up (lo = mid). Catches > vs < swap
statusReason: expected 0.2546875 to be greater than 1

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:66:10
 }
 
 export function _needsHigherWeights(achievedRtp: number, targetRtp: number): boolean {
-  return achievedRtp < targetRtp;
+  return achievedRtp >= targetRtp;
 }
 
killedBy: W244-W8 SENS-helper unit: `_needsHigherWeights` strict `<` semantics returns FALSE when achievedRtp EQUALS targetRtp (boundary)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:66:10
 }
 
 export function _needsHigherWeights(achievedRtp: number, targetRtp: number): boolean {
-  return achievedRtp < targetRtp;
+  return achievedRtp <= targetRtp;
 }
 
killedBy: W244-W8 SENS-helper unit: `_needsHigherWeights` strict `<` semantics returns FALSE when achievedRtp EQUALS targetRtp (boundary)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:85:7
   opts?: AnalyzeSensitivityOpts,
 ): Promise<SensitivityReport> {
   // Non-weighted: return empty deltas gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (ir.reels.mode === 'weighted') {
     return {
       baseRtp: 0,
killedBy: W244-P2 SENS-L68: analyzeSensitivity propagates explicit evalSpins analyzeSensitivity(ir, {evalSpins: 200}) → every runIRSimulation call uses spins=200
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:85:7
   opts?: AnalyzeSensitivityOpts,
 ): Promise<SensitivityReport> {
   // Non-weighted: return empty deltas gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (true) {
     return {
       baseRtp: 0,
killedBy: W244-P2 SENS-L68: analyzeSensitivity propagates explicit evalSpins analyzeSensitivity(ir, {evalSpins: 200}) → every runIRSimulation call uses spins=200
statusReason: expected "spy" to be called at least once

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:94:21
     };
   }
 
-  const evalSpins = opts?.evalSpins ?? 10000;
+  const evalSpins = opts?.evalSpins && 10000;
   const delta = opts?.delta ?? 0.1;
   const multiplier = 1 + delta;
killedBy: W244-P2 SENS-L68: analyzeSensitivity propagates explicit evalSpins analyzeSensitivity(ir, {evalSpins: 200}) → every runIRSimulation call uses spins=200
statusReason: expected 10000 to be 200 // Object.is equality

[Killed] OptionalChaining
src/sensitivity/analyzer.ts:94:21
     };
   }
 
-  const evalSpins = opts?.evalSpins ?? 10000;
+  const evalSpins = opts.evalSpins ?? 10000;
   const delta = opts?.delta ?? 0.1;
   const multiplier = 1 + delta;
killedBy: W239 — analyzeSensitivity default opts (L68) omitted opts → evalSpins defaults to 10000 and runs successfully
statusReason: Cannot read properties of undefined (reading 'evalSpins')

[Killed] OptionalChaining
src/sensitivity/analyzer.ts:95:17
   }
 
   const evalSpins = opts?.evalSpins ?? 10000;
-  const delta = opts?.delta ?? 0.1;
+  const delta = opts.delta ?? 0.1;
   const multiplier = 1 + delta;
 
killedBy: analyzer-strength: analyzeSensitivity default evalSpins=10000, delta=0.1 (opts undefined path)
statusReason: Cannot read properties of undefined (reading 'delta')

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:95:17
   }
 
   const evalSpins = opts?.evalSpins ?? 10000;
-  const delta = opts?.delta ?? 0.1;
+  const delta = opts?.delta && 0.1;
   const multiplier = 1 + delta;
 
killedBy: W239 — analyzeSensitivity delta arithmetic shape (L93-95) sensitivity = rtpDelta / delta (kills * mutant)
statusReason: expected -0.600000000000005 to be close to -0.120000000000001, received difference is 0.480000000000004, but expected 5e-10

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:96:22
 
   const evalSpins = opts?.evalSpins ?? 10000;
   const delta = opts?.delta ?? 0.1;
-  const multiplier = 1 + delta;
+  const multiplier = 1 - delta;
 
   // Run base simulation
killedBy: W239-FINAL — analyzeSensitivity multiplier direction asymmetry (line 70) with delta=0.5, perturbed S_W (wild) drives rtp UP, not down
statusReason: expected -1.202 to be greater than 0

[Killed] ArrowFunction
src/sensitivity/analyzer.ts:105:41
 
   // Collect unique symbol IDs across all reels
   const reels = ir.reels as Extract<typeof ir.reels, { mode: 'weighted' }>;
-  const allReelIndices = reels.base.map((_, i) => i);
+  const allReelIndices = reels.base.map(() => undefined);
   const symbolIds = new Set<string>();
   for (const reelMap of reels.base) {
killedBy: W239 — analyzeSensitivity reel-index map returns numeric index (L79) all-reel indices traverse 0..N-1 — sensitivity ran across every reel
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:107:37
   const reels = ir.reels as Extract<typeof ir.reels, { mode: 'weighted' }>;
   const allReelIndices = reels.base.map((_, i) => i);
   const symbolIds = new Set<string>();
-  for (const reelMap of reels.base) {
-    for (const key of Object.keys(reelMap)) {
-      symbolIds.add(key);
-    }
-  }
+  for (const reelMap of reels.base) {}
 
   const deltas: SensitivityDelta[] = [];
killedBy: analyzer-strength: analyzeSensitivity weighted IR → returns ≥ 1 delta per unique symbol
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/sensitivity/analyzer.ts:108:45
   const allReelIndices = reels.base.map((_, i) => i);
   const symbolIds = new Set<string>();
   for (const reelMap of reels.base) {
-    for (const key of Object.keys(reelMap)) {
-      symbolIds.add(key);
-    }
+    for (const key of Object.keys(reelMap)) {}
   }
 
killedBy: W239 — analyzeSensitivity default opts (L68) omitted opts → evalSpins defaults to 10000 and runs successfully
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/sensitivity/analyzer.ts:115:37
 
   const deltas: SensitivityDelta[] = [];
 
-  for (const symbolId of symbolIds) {
-    const perturbedIr = applyWeightMultiplier(ir, symbolId, allReelIndices, multiplier);
-    const perturbedResult = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
-
-    const rtpDelta = perturbedResult.rtp - baseRtp;
-    const hitRateDelta = perturbedResult.hitRate - baseHitRate;
-    const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
-
-    deltas.push({
-      reelIndex: -1,
-      symbolId,
-      delta,
-      rtpDelta,
-      hitRateDelta,
-      sensitivity,
-    });
-  }
+  for (const symbolId of symbolIds) {}
 
   // Sort by |sensitivity| descending, take top 5
killedBy: W239-FINAL — analyzeSensitivity multiplier direction asymmetry (line 70) with delta=0.5, perturbed S_W (wild) drives rtp UP, not down
statusReason: expected undefined not to be undefined

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:119:22
     const perturbedIr = applyWeightMultiplier(ir, symbolId, allReelIndices, multiplier);
     const perturbedResult = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
 
-    const rtpDelta = perturbedResult.rtp - baseRtp;
+    const rtpDelta = perturbedResult.rtp + baseRtp;
     const hitRateDelta = perturbedResult.hitRate - baseHitRate;
     const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
killedBy: W239 — analyzeSensitivity delta arithmetic shape (L93-95) |rtpDelta| is small (subtraction, not addition)
statusReason: expected 16.42 to be less than 2

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:120:26
     const perturbedResult = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
 
     const rtpDelta = perturbedResult.rtp - baseRtp;
-    const hitRateDelta = perturbedResult.hitRate - baseHitRate;
+    const hitRateDelta = perturbedResult.hitRate + baseHitRate;
     const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
 
killedBy: MUT-AS-04: analyzeSensitivity — perturbedResult deltas use SUBTRACTION not addition (line 93/94 ArithmeticOperator) rtpDelta is small (perturbed - base), not large (perturbed + base)
statusReason: expected 1.754 to be less than 0.5

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:121:25
 
     const rtpDelta = perturbedResult.rtp - baseRtp;
     const hitRateDelta = perturbedResult.hitRate - baseHitRate;
-    const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
+    const sensitivity = delta === 0 ? rtpDelta / delta : 0;
 
     deltas.push({
killedBy: W239 — analyzeSensitivity multiplier direction (L70) multiplier = 1 + delta (not 1 - delta): perturbed weights grow
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:121:25
 
     const rtpDelta = perturbedResult.rtp - baseRtp;
     const hitRateDelta = perturbedResult.hitRate - baseHitRate;
-    const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
+    const sensitivity = true ? rtpDelta / delta : 0;
 
     deltas.push({
killedBy: W239 — analyzeSensitivity delta=0 guard (L95) delta=0 produces sensitivity=0, no NaN
statusReason: expected true to be false // Object.is equality

[Killed] UnaryOperator
src/sensitivity/analyzer.ts:124:18
     const sensitivity = delta !== 0 ? rtpDelta / delta : 0;
 
     deltas.push({
-      reelIndex: -1,
+      reelIndex: +1,
       symbolId,
       delta,
killedBy: INTEGRATION-19: classic-3x3-lines topInfluencers topInfluencers has 1-5 entries with valid fields
statusReason: expected 1 to be -1 // Object.is equality

[Killed] MethodExpression
src/sensitivity/analyzer.ts:134:26
   }
 
   // Sort by |sensitivity| descending, take top 5
-  const topInfluencers = deltas
-    .slice()
-    .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
-    .slice(0, 5);
+  const topInfluencers = deltas.slice().sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity));
 
   return {
killedBy: INTEGRATION-19: classic-3x3-lines topInfluencers topInfluencers has 1-5 entries with valid fields
statusReason: expected 6 to be less than or equal to 5

[Killed] MethodExpression
src/sensitivity/analyzer.ts:134:26
   }
 
   // Sort by |sensitivity| descending, take top 5
-  const topInfluencers = deltas
-    .slice()
+  const topInfluencers = deltas
     .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
     .slice(0, 5);
killedBy: W239 — analyzeSensitivity topInfluencers sort isolation (L108) deltas array preserves Set insertion order (kills `.slice()` removal mutant)
statusReason: expected [ 'S_W', 'S_B', 'S_A' ] to deeply equal [ 'S_A', 'S_B', 'S_W' ]

[Killed] ArrowFunction
src/sensitivity/analyzer.ts:136:11
   // Sort by |sensitivity| descending, take top 5
   const topInfluencers = deltas
     .slice()
-    .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
+    .sort(() => undefined)
     .slice(0, 5);
 
killedBy: analyzer-strength: analyzeSensitivity topInfluencers ≤ 5 entries, sorted by |sensitivity| descending
statusReason: expected 0 to be greater than or equal to 0.30000000000000027

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:136:21
   // Sort by |sensitivity| descending, take top 5
   const topInfluencers = deltas
     .slice()
-    .sort((a, b) => Math.abs(b.sensitivity) - Math.abs(a.sensitivity))
+    .sort((a, b) => Math.abs(b.sensitivity) + Math.abs(a.sensitivity))
     .slice(0, 5);
 
killedBy: analyzer-strength: analyzeSensitivity topInfluencers ≤ 5 entries, sorted by |sensitivity| descending
statusReason: expected 0 to be greater than or equal to 0.30000000000000027

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:157:21
   ir: SlotGameIR,
   config: InverseSolverConfig,
 ): Promise<InverseSolverResult> {
-  const tolerance = config.tolerance ?? 0.001;
+  const tolerance = config.tolerance && 0.001;
   const maxIterations = config.maxIterations ?? 50;
   const evalSpins = config.evalSpins ?? 10000;
killedBy: analyzer-strength: solveTargetRtp bisection converged when |achievedRtp − target| < tolerance
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:158:25
   config: InverseSolverConfig,
 ): Promise<InverseSolverResult> {
   const tolerance = config.tolerance ?? 0.001;
-  const maxIterations = config.maxIterations ?? 50;
+  const maxIterations = config.maxIterations && 50;
   const evalSpins = config.evalSpins ?? 10000;
   const varyReels = config.varyReels;
killedBy: W239 — solveTargetRtp default opts (L133) omitted maxIterations → defaults to 50 (assert iterations ≤ 50)
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:159:21
 ): Promise<InverseSolverResult> {
   const tolerance = config.tolerance ?? 0.001;
   const maxIterations = config.maxIterations ?? 50;
-  const evalSpins = config.evalSpins ?? 10000;
+  const evalSpins = config.evalSpins && 10000;
   const varyReels = config.varyReels;
 
killedBy: W244-P2 SENS-L133: solveTargetRtp propagates explicit evalSpins solveTargetRtp({evalSpins:150}) → every runIRSimulation uses spins=150
statusReason: expected 10000 to be 150 // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:163:37
   const varyReels = config.varyReels;
 
   // Non-weighted: return gracefully
-  if (ir.reels.mode !== 'weighted') {
-    return {
-      converged: false,
-      iterations: 0,
-      achievedRtp: 0,
-      targetRtp: config.targetRtp,
-      error: Math.abs(config.targetRtp),
-      solvedIr: ir,
-      weightChange: 1,
-    };
-  }
+  if (ir.reels.mode !== 'weighted') {}
 
   const allReelIndices = (ir.reels as Extract<typeof ir.reels, { mode: 'weighted' }>)
killedBy: analyzer-strength: solveTargetRtp bisection non-weighted IR → returns converged=false, iterations=0
statusReason: expected 50 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:163:7
   const varyReels = config.varyReels;
 
   // Non-weighted: return gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (true) {
     return {
       converged: false,
killedBy: W239 — solveTargetRtp default opts (L133) omitted maxIterations → defaults to 50 (assert iterations ≤ 50)
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:164:12
 
   // Non-weighted: return gracefully
   if (ir.reels.mode !== 'weighted') {
-    return {
-      converged: false,
-      iterations: 0,
-      achievedRtp: 0,
-      targetRtp: config.targetRtp,
-      error: Math.abs(config.targetRtp),
-      solvedIr: ir,
-      weightChange: 1,
-    };
+    return {};
   }
 
killedBy: analyzer-strength: solveTargetRtp bisection non-weighted IR → returns converged=false, iterations=0
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:165:18
   // Non-weighted: return gracefully
   if (ir.reels.mode !== 'weighted') {
     return {
-      converged: false,
+      converged: true,
       iterations: 0,
       achievedRtp: 0,
killedBy: analyzer-strength: solveTargetRtp bisection non-weighted IR → returns converged=false, iterations=0
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/sensitivity/analyzer.ts:176:15
   }
 
   const allReelIndices = (ir.reels as Extract<typeof ir.reels, { mode: 'weighted' }>)
-    .base.map((_, i) => i);
+    .base.map(() => undefined);
   const reelIndices = varyReels ?? allReelIndices;
 
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with wild as last symbol still finds and uses it
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:177:23
 
   const allReelIndices = (ir.reels as Extract<typeof ir.reels, { mode: 'weighted' }>)
     .base.map((_, i) => i);
-  const reelIndices = varyReels ?? allReelIndices;
+  const reelIndices = varyReels && allReelIndices;
 
   let lo = 0.1;
killedBy: analyzer-strength: solveTargetRtp bisection varyReels=[0] → only reel 0 weights change
statusReason: expected 13 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:185:19
   let achievedRtp = 0;
   let solvedIr = ir;
   let weightChange = 1;
-  let converged = false;
+  let converged = true;
 
   for (let i = 0; i < maxIterations; i++) {
killedBy: analyzer-strength: solveTargetRtp bisection iterations counter increments by 1 per loop (catches `iterations--` mutant)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:187:43
   let weightChange = 1;
   let converged = false;
 
-  for (let i = 0; i < maxIterations; i++) {
-    iterations++;
-    const mid = (lo + hi) / 2;
-    const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
-    const result = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
-    achievedRtp = result.rtp;
-    solvedIr = perturbedIr;
-    weightChange = mid;
-
-    const error = Math.abs(achievedRtp - config.targetRtp);
-    if (_hasConverged(error, tolerance)) {
-      converged = true;
-      break;
-    }
-
-    // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (_needsHigherWeights(achievedRtp, config.targetRtp)) {
-      lo = mid;
-    } else {
-      hi = mid;
-    }
-  }
+  for (let i = 0; i < maxIterations; i++) {}
 
   return {
killedBy: analyzer-strength: solveTargetRtp bisection default tolerance=0.001 + maxIterations=50 + evalSpins=10000
statusReason: expected 0 to be greater than or equal to 1

[Killed] UpdateOperator
src/sensitivity/analyzer.ts:188:5
   let converged = false;
 
   for (let i = 0; i < maxIterations; i++) {
-    iterations++;
+    iterations--;
     const mid = (lo + hi) / 2;
     const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
killedBy: analyzer-strength: solveTargetRtp bisection default tolerance=0.001 + maxIterations=50 + evalSpins=10000
statusReason: expected -5 to be greater than or equal to 1

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:189:18
 
   for (let i = 0; i < maxIterations; i++) {
     iterations++;
-    const mid = (lo + hi) / 2;
+    const mid = (lo - hi) / 2;
     const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
     const result = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
killedBy: analyzer-strength: solveTargetRtp bisection varyReels undefined → falls back to allReelIndices
statusReason: expected -1.2125 to be greater than 0.1

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:189:17
 
   for (let i = 0; i < maxIterations; i++) {
     iterations++;
-    const mid = (lo + hi) / 2;
+    const mid = (lo + hi) * 2;
     const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
     const result = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
killedBy: analyzer-strength: solveTargetRtp bisection varyReels undefined → falls back to allReelIndices
statusReason: expected 81.4 to be less than or equal to 10
