[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:191:55
     iterations++;
     const mid = (lo + hi) / 2;
     const perturbedIr = applyWeightMultiplier(ir, config.varySymbol, reelIndices, mid);
-    const result = await runIRSimulation(perturbedIr, { spins: evalSpins, seed: 42 });
+    const result = await runIRSimulation(perturbedIr, {});
     achievedRtp = result.rtp;
     solvedIr = perturbedIr;
killedBy: analyzer-strength: solveTargetRtp bisection achievedRtp > target → hi moves down
statusReason: expected 9.8453125 to be less than 1

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:196:28
     solvedIr = perturbedIr;
     weightChange = mid;
 
-    const error = Math.abs(achievedRtp - config.targetRtp);
+    const error = Math.abs(achievedRtp + config.targetRtp);
     if (_hasConverged(error, tolerance)) {
       converged = true;
killedBy: W244 SENS-04: autoTune honours explicit rtpTolerance passing rtpTolerance=0.5 (lax) converges quickly without forcing default 0.005
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:197:9
     weightChange = mid;
 
     const error = Math.abs(achievedRtp - config.targetRtp);
-    if (_hasConverged(error, tolerance)) {
+    if (true) {
       converged = true;
       break;
killedBy: analyzer-strength: solveTargetRtp bisection iterations counter increments by 1 per loop (catches `iterations--` mutant)
statusReason: expected 1 to be 7 // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:197:42
     weightChange = mid;
 
     const error = Math.abs(achievedRtp - config.targetRtp);
-    if (_hasConverged(error, tolerance)) {
-      converged = true;
-      break;
-    }
+    if (_hasConverged(error, tolerance)) {}
 
     // If achievedRtp < targetRtp → need higher weights → lo = mid
killedBy: analyzer-strength: solveTargetRtp bisection converged when |achievedRtp − target| < tolerance
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:198:19
 
     const error = Math.abs(achievedRtp - config.targetRtp);
     if (_hasConverged(error, tolerance)) {
-      converged = true;
+      converged = false;
       break;
     }
killedBy: analyzer-strength: solveTargetRtp bisection converged when |achievedRtp − target| < tolerance
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/sensitivity/analyzer.ts:203:61
     }
 
     // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (_needsHigherWeights(achievedRtp, config.targetRtp)) {
-      lo = mid;
-    } else {
+    if (_needsHigherWeights(achievedRtp, config.targetRtp)) {} else {
       hi = mid;
     }
killedBy: W244-P2 SENS-L177: solveTargetRtp bisection raises `lo` when underRTP feeding monotonically-rising RTPs proves lo = mid path executes (kills BlockStatement → {})
statusReason: expected 5.05 not to be 5.05 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:203:9
     }
 
     // If achievedRtp < targetRtp → need higher weights → lo = mid
-    if (_needsHigherWeights(achievedRtp, config.targetRtp)) {
+    if (false) {
       lo = mid;
     } else {
killedBy: analyzer-strength: solveTargetRtp bisection achievedRtp < target → lo moves up (lo = mid). Catches > vs < swap
statusReason: expected 0.2546875 to be greater than 1

[Killed] BlockStatement
src/sensitivity/analyzer.ts:205:12
     // If achievedRtp < targetRtp → need higher weights → lo = mid
     if (_needsHigherWeights(achievedRtp, config.targetRtp)) {
       lo = mid;
-    } else {
-      hi = mid;
-    }
+    } else {}
   }
 
killedBy: W239 — solveTargetRtp error arithmetic & convergence boundary (L170-177) convergence requires error < tolerance, not <= (strict equality kill)
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/sensitivity/analyzer.ts:215:21
     iterations,
     achievedRtp,
     targetRtp: config.targetRtp,
-    error: Math.abs(achievedRtp - config.targetRtp),
+    error: Math.abs(achievedRtp + config.targetRtp),
     solvedIr,
     weightChange,
killedBy: W239 — solveTargetRtp error arithmetic & convergence boundary (L170-177) error is computed as |achievedRtp - target| (kills + mutant)
statusReason: expected 11.243333333333332 to be close to 9.323333333333334, received difference is 1.9199999999999982, but expected 5e-10

[Killed] EqualityOperator
src/sensitivity/analyzer.ts:232:7
   config: AutoTunerConfig,
 ): Promise<AutoTunerResult> {
   // Non-weighted: return gracefully
-  if (ir.reels.mode !== 'weighted') {
+  if (ir.reels.mode === 'weighted') {
     return {
       converged: false,
killedBy: W244 SENS-04: autoTune honours explicit rtpTolerance passing rtpTolerance=0.5 (lax) converges quickly without forcing default 0.005
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/sensitivity/analyzer.ts:233:12
 ): Promise<AutoTunerResult> {
   // Non-weighted: return gracefully
   if (ir.reels.mode !== 'weighted') {
-    return {
-      converged: false,
-      achievedRtp: 0,
-      iterations: 0,
-      solvedIr: ir,
-    };
+    return {};
   }
 
killedBy: W244-P2 SENS-L207: autoTune non-weighted returns FULL placeholder shape returned object owns all 4 fields (kills ObjectLiteral → {})
statusReason: expected [] to include 'converged'

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:241:24
     };
   }
 
-  const rtpTolerance = config.rtpTolerance ?? 0.005;
+  const rtpTolerance = config.rtpTolerance && 0.005;
   const maxIterations = config.maxIterations ?? 20;
   const evalSpins = config.evalSpins ?? 10000;
killedBy: W244 SENS-04: autoTune honours explicit rtpTolerance passing rtpTolerance=0.5 (lax) converges quickly without forcing default 0.005
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:242:25
   }
 
   const rtpTolerance = config.rtpTolerance ?? 0.005;
-  const maxIterations = config.maxIterations ?? 20;
+  const maxIterations = config.maxIterations && 20;
   const evalSpins = config.evalSpins ?? 10000;
 
killedBy: W239 — autoTune default opts (L215-L217) omitted maxIterations → defaults to 20
statusReason: expected 50 to be less than or equal to 20

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:243:21
 
   const rtpTolerance = config.rtpTolerance ?? 0.005;
   const maxIterations = config.maxIterations ?? 20;
-  const evalSpins = config.evalSpins ?? 10000;
+  const evalSpins = config.evalSpins && 10000;
 
   // Find wild symbol or fall back to first symbol
killedBy: W244-P2 SENS-L217: autoTune propagates explicit evalSpins to inner sim autoTune({evalSpins:175}) → every runIRSimulation uses spins=175
statusReason: expected 10000 to be 175 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:246:45
   const evalSpins = config.evalSpins ?? 10000;
 
   // Find wild symbol or fall back to first symbol
-  const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
+  const wildSymbol = ir.symbols.find((s) => false);
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with wild as last symbol still finds and uses it
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:246:45
   const evalSpins = config.evalSpins ?? 10000;
 
   // Find wild symbol or fall back to first symbol
-  const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
+  const wildSymbol = ir.symbols.find((s) => true);
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with wild as last symbol still finds and uses it
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] OptionalChaining
src/sensitivity/analyzer.ts:247:22
 
   // Find wild symbol or fall back to first symbol
   const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
-  const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
+  const varySymbol = wildSymbol.id ?? ir.symbols[0]?.id ?? '';
 
   if (!varySymbol) {
killedBy: W244 SENS-05: autoTune detects wild symbol by kind, not by index IR with NO wild symbol falls back to the first symbol (LP1)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/sensitivity/analyzer.ts:247:22
 
   // Find wild symbol or fall back to first symbol
   const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
-  const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
+  const varySymbol = (wildSymbol?.id ?? ir.symbols[0]?.id) && '';
 
   if (!varySymbol) {
killedBy: W244 SENS-04: autoTune honours explicit rtpTolerance passing rtpTolerance=0.5 (lax) converges quickly without forcing default 0.005
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/sensitivity/analyzer.ts:249:7
   const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
-  if (!varySymbol) {
+  if (varySymbol) {
     return {
       converged: false,
killedBy: W239 — autoTune wild lookup & fallback id (L220) finds wild symbol and uses its id as varySymbol
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/sensitivity/analyzer.ts:249:20
   const wildSymbol = ir.symbols.find((s) => s.kind === 'wild');
   const varySymbol = wildSymbol?.id ?? ir.symbols[0]?.id ?? '';
 
-  if (!varySymbol) {
-    return {
-      converged: false,
-      achievedRtp: 0,
-      iterations: 0,
-      solvedIr: ir,
-    };
-  }
+  if (!varySymbol) {}
 
   const solverResult = await solveTargetRtp(ir, {
killedBy: W239 — autoTune wild lookup & fallback id (L220) no wild and no symbols → empty varySymbol → early-return with iterations=0
statusReason: expected 20 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:275:22
   return {
     converged: solverResult.converged,
     achievedRtp: solverResult.achievedRtp,
-    achievedHitRate: config.targetHitRate != null ? finalResult.hitRate : undefined,
+    achievedHitRate: true ? finalResult.hitRate : undefined,
     iterations: solverResult.iterations,
     solvedIr: solverResult.solvedIr,
killedBy: analyzer-strength: autoTune wild-symbol detection targetHitRate undefined → achievedHitRate is undefined
statusReason: expected 0.84 to be undefined

[Killed] ConditionalExpression
src/sensitivity/analyzer.ts:275:22
   return {
     converged: solverResult.converged,
     achievedRtp: solverResult.achievedRtp,
-    achievedHitRate: config.targetHitRate != null ? finalResult.hitRate : undefined,
+    achievedHitRate: false ? finalResult.hitRate : undefined,
     iterations: solverResult.iterations,
     solvedIr: solverResult.solvedIr,
killedBy: TUNER-15: autoTune returns achievedHitRate when targetHitRate set achievedHitRate is defined
statusReason: expected undefined not to be undefined
